Talk(17, "어떻게 들어왔지？ 금화파파는？", "talkname17", 0);
Talk(0, "우연히 지나는 길에 금화파파와 싸우게 됐죠。 이곳에 사람이 갇힌 것 같아 당신을 구한 겁니다。 왜 이곳에 갇혀있나요？", "talkname0", 1);
Talk(17, "난 왕난고라 하는데， 호접곡 의선 호청우의 아내야。 오래전에 은엽 선생을 치료하지 않아 죽게 한 일이 있었는데， 영사도의 주인 금화파파가 바로 그의 부인이야。 며칠 전， 금화파파는 복수를 위해 남편을 제압하고 날 이곳에 가둬 놓았어… 우리 부부에게도 똑같은 생이별의 고통을 느끼게 하려는 지난날의 복수겠지…", "talkname17", 0);
Talk(0, "그랬었군요… 이젠 풀어드릴 테니 호접곡으로 돌아가세요。", "talkname0", 1);
Talk(17, "날 구해준 은혜는 평생 잊지 않겠네。", "talkname17", 0);
Talk(0, "천만의 말씀！ 남을 돕는 건 무인이면 당연히 해야 할 일이죠。", "talkname0", 1);
Talk(17, "난 호접곡으로 돌아갈게。 후에 시간이 있으면 호접곡으로 놀러 오게。 호접곡은 은밀하여， 찾기가 쉽지 않아。 좌표를 잘 외워둬！（２３８，２１９）。 자네에게 줄 물건이 있으니 반드시 찾아오게나！", "talkname17", 0);
Talk(0, "조심히 가세요。", "talkname0", 1);
ModifyEvent(-2, -2, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2); --移除王难姑
jyx2_ReplaceSceneObject("", "NPC/王难姑", ""); 

ModifyEvent(44, 1, 1, 1, 123, -1, -1, 5290, 5290, 5290, -2, -2, -2); --在蝴蝶谷将王难姑设置为显示
jyx2_ReplaceSceneObject("44", "NPC/王难姑", "1"); 

ModifyEvent(44, 0, -2, -2, 95, -1, -1, -2, -2, -2, -2, -2, -2);

DarkScence();
LightScence();
AddEthics(2);
do return end;
