Talk(15, "애송아！ 왜 영사도에 왔느냐！ 왜 매번 영사도로 와서 날 괴롭히는 거지？", "talkname15", 0);
Talk(0, "당신의 정체를 알아요。 명교의 사대호법 중 하나인 자삼용왕이죠？", "talkname0", 1);
Talk(15, "보통 놈이 아니군！ 내 진짜 신분을 알다니。 용건을 말하라！", "talkname15", 0);
Talk(0, "광명정으로 귀환하라는 말을 전하러 왔어요。", "talkname0", 1);
Talk(15, "가서 뭐 하지？ 교주 자리를 두고 싸우는 모습을 보라고？ 차라리 여기서의 조용한 생활을 택하겠다！", "talkname15", 0);
Talk(0, "양 교주는 용왕을 부교주로 임영하라는 유언을 남기셨소。 모든 일을 설명하자면……", "talkname0", 1);
Talk(15, "잘 됐군！ 사사형이 있으면， 명교를 잘 다스릴 거야。 나는 안심하고 여기서 살면 되겠어。", "talkname15", 0);
Talk(0, "격장지계를 써봐야지' 명교의 \"광명성화진\" 따윈 하나도 겁나지 않아！ 육대파에게 협공당했을 때 내가 아니었으면 모두 죽었을걸！ \"의천도룡기\"를 주기 싫으면 말로 하지 왜 이런 연극을 하는 거죠？", "talkname0", 1);
Talk(15, "뭐라고？ 너 같은 애송이가 명교를 구했단 말이냐？", "talkname15", 0);
Talk(0, "믿기 어려워도 사실인걸！", "talkname0", 1);
Talk(15, "운이 좋아서 이긴 주제에 큰 소릴 치는구나！ 더 높은 산이 있는 법！ 여태 \"광명성화진\" 을 격퇴한 사람은 아무도 없었다！", "talkname15", 0);
Talk(0, "눈으로 안보곤 못 믿겠어。", "talkname0", 1);
Talk(15, "건방진！ \"광명성화진\" 을 이길 자신이 있다면 광명정으로 오너라！", "talkname15", 0);
ModifyEvent(11, 90, 1, 1, 111, -1, -1, -2, -2, -2, -2, -2, -2);
ModifyEvent(11, 91, 1, 1, 112, -1, -1, -2, -2, -2, -2, -2, -2);
ModifyEvent(11, 92, 1, 1, 113, -1, -1, -2, -2, -2, -2, -2, -2);
ModifyEvent(11, 93, 1, 1, 114, -1, -1, -2, -2, -2, -2, -2, -2);
ModifyEvent(11, 94, 1, 1, 115, -1, -1, -2, -2, -2, -2, -2, -2);
DarkScence();
ModifyEvent(11, 101, 1, 1, 116, -1, -1, 5288, 5288, 5288, -2, -2, -2);
jyx2_ReplaceSceneObject("11", "NPC/金花婆婆101", "1");--紫衫龙王
ModifyEvent(-2, -2, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
jyx2_ReplaceSceneObject("", "NPC/金花婆婆", "");--紫衫龙王
LightScence();
ChangeMMapMusic(3);
do return end;
