ScenceFromTo(32, 33, 32, 24);
jyx2_CameraFollow("Level/NPC/miejueshitai");--by fanyu
Talk(6, "…마교는 불을 성스럽게 하고 불을 신으로 존경한다……마교는 제33대 교주 양정천이 갑자기 죽은 이후로 아직 계승자가 없다。 교 중 좌우 광명사자， 4대 호교법왕은 교주 자리를 놓고 암투를 벌이고 있지。 그래서 서로 죽여 쟁탈 하느라 이때부터 마교는 쇠퇴하였다。 그래서 지금이 바로 6대 문파가 합쳐서 마교를 섬멸시킬 절호의 기회다！ 만약 마교가 내분을 일으키지 못한다면， 이 불경한 것들을 처리하기 쉽지 않을 것이다。 6대파가 이번에 광명정을 토벌하여 필승의 뜻을 품고 있는데， 모든 마교놈들이 한마음으로 힘을 합쳐도 겁낼 건 아무것도 없다！ 다만 결전에는 사상자가 생기기 마련이니 각자 먼저 결사의 마음을 가져야만 한다。 요행을 바라서는 안 된다。 마음속에 두려움을 가진채로 적에게 임한다면 아미파의 위풍은 떨어질 것이다。 속담에 이르길 '천 개의 관이 문에서 나와야 그 집안이 매우 번창했더라。 자식이 아버지를 남겨두면 조상이 손자를 죽인다。' 라고 했다。 누가 죽지 않겠는가？ 자손의 피만 남길 수 있다면 그 집은 천백 명이 죽어도 흥성할 수 있다。 다만 너희들이 죽고 나면 늙은 나 혼자서 아미파를 이끌어야 하는 게 적막하기 짝이 없을 것이다。 아아！ 그래도 아깝지 않다！ 아아！ 백여 년 전에 아미파도 존재하지 않았거늘， 마교를 섬멸하는 게 우리의 사명이니 결연하게 악을 무찔러 정의를 세상에 빛내자！", "talkname6", 0);
Talk(77, "죽음을 각오하고 마교를 없애겠습니다！", "talkname77", 0);
Talk(6, "몰래 엿듣고 있는 쥐새끼가 한 마리 있구나！ 이놈！", "talkname6", 0);
ScenceFromTo(32, 24, 32, 33);
jyx2_CameraFollowPlayer();--by fanyu
Talk(0, "딱히 숨어있지 않았는데， 그리고 목소리가 너무 크니 당연히 들릴 수밖에！ ' 선배님의 일장연설에 절로 듣게 되었습니다。 후배가 아미파 장문인께 문안 인사드립니다。", "talkname0", 1);
ModifyEvent(-2, 0, -2, -2, -1, -1, -1, -2, -2, -2, -2, -2, -2);
ModifyEvent(-2, 1, -2, -2, -1, -1, -1, -2, -2, -2, -2, -2, -2);
ModifyEvent(-2, 11, -2, -2, -1, -1, 147, -2, -2, -2, -2, -2, -2);--by fanyu 启动脚本147 场景33-11
do return end;
