if InTeam(35) == false then goto label0 end;
    --jyx2_ReplaceSceneObject("", "NPC/令狐冲", "1");-- 原作不需要显示令狐冲，是否有必要？
    Talk(35, "사부님！", "talkname35", 1);
    Talk(19, "사제의 인연을 끊었으니 난 더 이상 네 사부가 아니다！", "talkname19", 0);
    Talk(35, "제자가 잘못을 범했으니 용서를 바라진 않습니다… 다만 문파에서 내쫓긴 벌만은 거두어 주십시오。", "talkname35", 1);
    Talk(19, "흥！ 나도 그러고 싶지 않겠나？ 오악 대회를 앞두고 네 사제들은 무공이 형편없으니 나도 애가 탄다。 장래 화산파가 어찌 될지 좀 더 두고 보겠다。", "talkname19", 0);
::label0::
    Talk(0, "최근 오악검파가 합병한다는 소문이 강호에 무성하게 퍼져있소。 악장문의 생각은 어떻소？", "talkname0", 1);
    Talk(19, "200년 역사의 화산파는 검종과 기종으로 나뉘었소。 한 문파끼리 벌였던 참혹한 결전을 떠올리면 아직도 가슴이 아프다오。 천고이래 숱한 무림인이 칼 아래 무참히 목숨을 잃었소。 연유를 따지자면 모두 타문파를 배척하는 마음에서 비롯된 것이오。 강호인들이 문파를 형성하지 않고 모두 한 가족처럼 지낼 수 있다면 각종 유혈참극도 막을 수 있을 것을……영웅호걸들도 천수의 수명을 온전히 누릴 것이며 고아들도 더 이상 생기지 않을 것이오。", "talkname19", 0);
    Talk(0, "\"군자검\" 악장문은 명불허전이군요。 무림 동료들이 악장문과 같은 생각을 가진다면 살생과 원한도 종적을 감출 것입니다！", "talkname0", 1);
    Talk(19, "무림 선배들 또한 같은 생각을 가지고 있겠지요。 문파를 배척함이 백해무익이란 걸 알면서도 왜 없애지 못할까？ 수 년 간 이 문제를 숙고한 결과 며칠 전에야 돌연히 깨닫는 바가 있었소。", "talkname19", 0);
    Talk(0, "악 장문의 견해는 틀림 없이 고명하시군요！", "talkname0", 1);
    Talk(19, "다년간 숙고한 결과， \"성급함\" 이 중요한 실책이란 걸 알게 됐소。", "talkname19", 0);
    Talk(19, "무림인은 하루아침에 계획했던 바를 눈으로 확인하고 싶어 하오。 하나 천하의 문파 수는 셀 수 없을 정도로 많지 않소？ 작은 문파에서 큰 문파까지， 수 천 개에 이르는데 각 문파가 지니던 역사를 하루 아침에 버리라는 건 큰 무리가 아니겠소？", "talkname19", 0);
    Talk(0, "숭산의 좌장문은 왜 오악 합병을 주장하는 거죠？", "talkname0", 1);
    Talk(19, "좌냉선은 야심이 크지！ 무림 맹주가 목표일걸세。 오악 검파의 맹주가 되는 건 시작에 불과하고， 합병한 뒤 스스로 장문이라 주장하여 세력을 넓힌 다음 소림， 무당과 견줄 수 있게 되지 않겠나？ 다음엔 곤륜파， 아미파， 공동파 등 모두 닥치는 대로 합병한다고 할걸세。 그런 뒤 무당， 소림사와 함께 마교에 도전하여 큰 적을 제거하겠지。", "talkname19", 0);
    Talk(0, "좌냉선의 무공은 절세 고수라 할 수 없거늘 왜 이런 일을 벌이는 거죠？", "talkname0", 1);
    Talk(19, "열 길 물속은 알아도， 한 길 사람 속은 모르는 법！ 좌냉선은 마교를 소탕한 다음， 유아독존으로 오르려 할 거야。 그리고 소림과 무당을 차례대로 제거하겠지。 거사는 무공만으로 성사시키는 게 아닐세。", "talkname19", 0);
    Talk(0, "좌냉선은 천하 무림을 장악하려는 속셈이군요！", "talkname0", 1);
    Talk(19, "야심은 충족되지 않아。 황제까지 꿈 꿀지 누가 알겠나？ 그런 뒤엔 불로불사의 허황된 꿈까지 꾸게 되겠지。 이것을 두고 '사람의 마음은 뱀이 코끼리를 삼켜도 부족하다'고 하는데， 예로부터 모두 이와 같았다네。 영웅호걸이어도 절대 이 권위의 관문을 벗어날 수 있는 사람이 없어。", "talkname19", 0);
    Talk(0,"인생은 일장춘몽인데， 왜 연연하죠？ 좌냉선이 무림을 장악하기 위해 얼마나 많은 사람들이 희생되었겠어요。 악장문！ 우리가 합심하여 좌냉선의 야욕을 막도록 합시다！", "talkname0", 1);
    Talk(19, "다음 달 보름 숭산 대회에서 악 가는 최선을 다 할 것이다。", "talkname19", 0);
    Talk(0, "저도 돕겠습니다。", "talkname0", 1);

    if InTeam(35) == false then goto label1 end;
        Talk(35, "네， 사부님。 우리 모두 돕겠습니다。", "talkname35", 1);
        Talk(19, "오직 네가 큰 공을 세우기를 바랄 뿐， 그래야만 다시 화산파 제자로 거둘 명분이 생긴다。", "talkname19", 0);
        Talk(35, "이 형제， 다음 달 보름에 꼭 숭산에 가서 좌냉선의 계략을 막아내자！", "talkname35", 1);
        --jyx2_ReplaceSceneObject("", "NPC/令狐冲", "");-- 
::label1::
        ModifyEvent(-2, -2, -2, -2, 196, -1, -1, -2, -2, -2, -2, -2, -2);
        Add3EventNum(27, 0, 0, 0, 1);--需要拜访嵩山以外4派才会触发五岳并派事件。嵩山入口0号trigger对应起始事件为198，每拜访1派事件序号+1，202号事件为并派事件。
do return end;
