Talk(0, "여기가 \"화산논검\" 이 열렸던 화산이 맞나요？", "talkname0", 1);
Talk(81, "그렇소， 4년 만에 열리는 \"화산논검\" 을 화산파에서 개최하고 있소만 장소는 화산의 다른 산봉우리고， 여긴 화산파가 무공을 연공하여 수행하는 장소요。", "talkname81", 0);
if InTeam(35) == false then goto label0 end;
    Talk(35, "별일 없나？", "talkname35", 1);
    Talk(81, "대사형！", "talkname81", 0);
    Talk(35, "이젠 화산파 제자가 아니니 사형이 아니다！ 우린 지금 유랑 중이다。", "talkname35", 1);
::label0::
    Talk(0, "귀파의 장문인 \"군자검\" 악불군은 성인군자라던데 만나 뵐 수 있겠소？", "talkname0", 1);
    Talk(81, "안에 계시니 따라오시죠。", "talkname81", 0);
    ModifyEvent(-2, 2, -2, -2, 193, -1, -1, -2, -2, -2, -2, -2, -2);
    ModifyEvent(-2, 3, -2, -2, 194, -1, -1, -2, -2, -2, -2, -2, -2);
    ModifyEvent(-2, 4, -2, -2, 211, -1, -1, -2, -2, -2, -2, -2, -2);
    ModifyEvent(-2, 5, -2, -2, 193, -1, -1, -2, -2, -2, -2, -2, -2);
    ModifyEvent(-2, 6, -2, -2, 194, -1, -1, -2, -2, -2, -2, -2, -2);
do return end;
