Talk(31, "형님， 이 애송이가 소란을 부렸습니다。 복수를 해주세요。", "talkname31", 0);
Talk(33, "이 젊은이는 정의롭게 생겼군， 소란을 부릴 자가 아니다。", "talkname33", 0);
Talk(0, "이 장주가 사람 보는 눈이 있군요。 고맙소。", "talkname0", 1);
Talk(32, "형님， 속으면 안 돼요。 우리 매장에서……", "talkname32", 0);
Talk(33, "됐다！ 듣기 싫다！ 소협， 그만 갈 길 가시기 바라오。", "talkname33", 0);
ModifyEvent(-2, 9, -2, -2, 255, 258, -2, -2, -2, -2, -2, -2, -2);
ModifyEvent(-2, 10, -2, -2, 256, -1, -1, -2, -2, -2, -2, -2, -2);
ModifyEvent(-2, 11, -2, -2, 257, -1, -1, -2, -2, -2, -2, -2, -2);
do return end;
