Talk(31, "셋째 형님， 바로 이놈입니다！", "talkname31", 0);

Talk(32, "소협은 나이도 어린데 넷째 동생을 이기다니 실로 감탄했소。", "talkname32", 0);
Talk(0, "천만에요。 셋째 장주 독필옹인가요？", "talkname0", 1);
Talk(32, "바로 노부요。", "talkname32", 0);
Talk(31, "형님， 내 복수를 해주고 \"계산행려도\" 란 그림도 빼앗아 주세요。 부탁이오。", "talkname31", 0);
Talk(32, "사제， 넌 창피하지도 않느냐！ 멀리 나가지 않겠소。", "talkname32", 0);
ModifyEvent(-2, 6, -2, -2, 252, 253, -2, -2, -2, -2, -2, -2, -2);
ModifyEvent(-2, 7, -2, -2, 252, 253, -2, -2, -2, -2, -2, -2, -2);
ModifyEvent(-2, 8, -2, -2, 280, -1, -1, -2, -2, -2, -2, -2, -2);
do return end;
