Talk(4, "소협， 요즘 어떤가？ \"십사천서\"는 많이 찾았나？", "talkname4", 0);
Talk(0, "왜 이래！ 이렇게나 책의 행방에 관심을 가지다니。 만약 다 찾았다면， 이번에는 또 무슨 독약을 준비해서 시중을 들려고？ \"기음합환산\"'， 아니면 \"아애일조재\"？", "talkname0", 1);
Talk(4, "그 두가지 약이 어느 문파에서 제조한 약인지 모르겠군。 최근에 새로 제조된 것인가？ 약효는 어떤가？ (역주 : 주성치 주연의 영화 \"녹정기\" 시리즈에 나오는 독약。 \"기음합환산\"- 복용자가 하루동안 성관계를 하지 않으면 죽게 되는 독약。 \"아애일조재\"- 강한 발정제 )", "talkname4", 0);
Talk(0, "주성치가 배합하여 제조한 것이니 약효는 천하제일이지！", "talkname0", 1);
Talk(4, "만약 주 대협을 만난다면 무슨 수를 써서라도 약의 제조법을 배워야한다'", "talkname4", 0);
Talk(0, "비트코인이 10억을 가도 안 될걸？'", "talkname0", 1);
ModifyEvent(-2, -2, -2, -2, 21, -2, -2, -2, -2, -2, -2, -2, -2);
ModifyEvent(-2, 7, -2, -2, -2, -2, -1, -2, -2, -2, -2, -2, -2);
do return end;
