if UseItem(177) == true then goto label0 end;
    do return end;
::label0::
    Talk(34, "\"광릉산\"！！！ 이 \"광릉산\"은 역사속으로 유실된 지 이미 오래되었거늘， 오늘 고인의 천하 명보를 보게되다니 참으로 기쁘기 그지없도다！ 평화롭지만 그 가운데 또 그윽하고 절묘하다。 마음을 가라앉혀 손가락으로 청아한 음률을 튕겨내니， 모든 사심이 사라지는구나！", "talkname34", 0);
    Talk(0, "대장주는 \"황종공\" 이란 별호답게 과연 음악의 대가시군요。 대장주께서 이 악보를 읽을 때 마음이 편안해지고 표정이 평온해지는 모습을 보았사온데， 과연 명성과 관록을 초월한 세외도인의 모습이었소。 이 악보는 세상에 단 하나밖에 없는 보물이오나 내겐 무용지물이니， 대장주께 드리는 게 도리일 것 같소。", "talkname0", 1);
    Talk(34, "옛말에 공이 없으면 녹을 받지 않는다고 했소。 형제들 말로는 누구라도 소협을 이기면 보물을 다 가질 수 있다고 했다는데 노부가 감히 소년 영웅께 도전해 보겠소。", "talkname34", 0);
    Talk(0, "출수하시죠！", "talkname0", 1);
    if TryBattle(46) == true then goto label1 end;
        Dead();
        do return end;
::label1::
        LightScence();
        Talk(34, "정말 훌륭한 무공이오。 탄복했소이다！ 노부는 그 \"광릉산\"을 누릴 복이 없나 보오。 순순히 포기하겠소。", "talkname34", 0);
        Talk(33, "형님， 다른 보물을 얻기 위해서라도 넷이서 같이 공격합시다！", "talkname33", 0);
        Talk(34, "안된다！ 네 사람이 한 사람을 공격하다니！ 그런 비겁한 짓은 못한다。", "talkname34", 0);
        Talk(33, "그럼 지하 감옥에 있는 노괴물을 부릅시다。", "talkname33", 0);
        Talk(34, "닥쳐라！！ 둘째！", "talkname34", 0);
        Talk(0, "매장에 다른 고수가 또 있습니까？ 매장 사람 중에 한 명이라도 날 이긴다면 네 가지 보물을 모두 드리지요。", "talkname0", 1);
        Talk(33, "걱정 마세요。 우리가 옆에 있는데 도망가지 못해요。", "talkname33", 0);
        Talk(34, "닥치라니까！ 우린 패배를 인정할 테니 소협은 이제 그만 돌아가 주시오。", "talkname34", 0);
        ModifyEvent(-2, -2, -2, -2, 265, -1, -1, -2, -2, -2, -2, -2, -2);
        ModifyEvent(-2, 16, -2, -2, 266, -1, -1, -2, -2, -2, -2, -2, -2);
        ModifyEvent(-2, 17, -2, -2, 267, -1, -1, -2, -2, -2, -2, -2, -2);
        ModifyEvent(-2, 18, -2, -2, 268, -1, -1, -2, -2, -2, -2, -2, -2);
        ModifyEvent(-2, 0, -2, -2, -1, -1, 269, -2, -2, -2, -2, -2, -2);
        ModifyEvent(-2, 1, -2, -2, -1, -1, 269, -2, -2, -2, -2, -2, -2);
        ModifyEvent(-2, 2, -2, -2, -1, -1, 269, -2, -2, -2, -2, -2, -2);
        AddRepute(3);
do return end;
