if InTeam(35) == true then goto label0 end;
    Talk(30, "……………………………………………", "talkname30", 0);
    do return end;
::label0::
    Talk(35, "노선배님은 뉘 쉬온데 화산의 사과애에 계신 거요？", "talkname35", 1);
    Talk(30, "화산 사람인데 왜 못 오겠느냐！", "talkname30", 0);
    Talk(35, "화산 사람이라구요？ 흠… 한 번도 뵌 기억이 없습니다만…", "talkname35", 1);
    Talk(30, "세인들은 나 풍모를 잊었을 것이야。", "talkname30", 0);
    Talk(35, "풍… 그렇다면… 사부님 말씀이 본파에 풍청양 태사숙이 계신다던데 바로 선배님이신가요？", "talkname35", 1);
    Talk(30, "풍청양이면 어떻고 다른 이름 석 자이면 어떠냐？", "talkname30", 0);
    Talk(35, "도손 영호충이 본문의 선배인 풍 태사숙을 뵙게 되다니！ 무한한 영광입니다！", "talkname35", 1);
    Talk(30, "검법이나 펼쳐봐라。 화산파 제자의 검실력이 어떤지 한 번 보자꾸나。", "talkname30", 0);
    Talk(35, "네， 알겠습니다。", "talkname35", 1);
    DarkScence();
    ModifyEvent(-2, 3, 1, 1, -1, -1, -1, 7624, 7624, 7624, -2, -2, -2);
    LightScence();
    --播放timeline
    jyx2_PlayTimelineSimple("[Timeline]ka284_思过崖_令狐冲演练");
    jyx2_Wait(4);
    PlayAnimation(3, 7624, 7654);
    PlayAnimation(3, 7624, 7654);
    DarkScence();
    ModifyEvent(-2, 3, 1, 1, -1, -1, -1, 7656, 7656, 7656, -2, -2, -2);
    jyx2_ReplaceSceneObject("", "NPC/令狐冲", "1");--令狐冲
	jyx2_FixMapObject("令狐冲表演后",1);
    LightScence();
    Talk(30, "악불군 그 자식은 정말 고지식하기 짝이 없어！ 넌 본디 크게 될 재목감인데 형편없는 썩은 나무로 만들어놨구나！ 초식은 죽은 것이요， 중요한 것은 검을 잡은 자의 마음이니라。 네 뜻에 따라 검을 펼치는 것이 검법의 본질임을 잊어선 안된다。 초식에만 매달리면 신공을 얻었다 해도 강자 앞에선 통하지 않음을 명심하거라。", "talkname30", 0);
    Talk(35, "네， 네！ 반드시 연마하고 수련하겠습니다！", "talkname35", 1);
    Talk(30, "오악검파엔 멍청이가 많지！ 검결만 외우면 고수가 된다고 착각하지만 당시 삼백 수를 외운다 한들 유명한 시인이 되겠느냐？ 시구를 외우되 깊은 뜻까지 통찰하여 창작해 내지 못하면 낙오자가 될 뿐이다。 검법의 요지를 깨닫고 출수하되， 초식이 없어야 진정한 고수가 되느니라。 아무리 빠른 검법도 초식에서 벗어나지 못하면 적에게 간파당하니까！ 하지만 초식이 없다면， 보이지 않는 검을 어찌 막으랴！", "talkname30", 0);
    Talk(35, "화산 사람이라구요？ 흠… 한 번도 뵌 기억이 없습니다만…", "talkname35", 1);
    Talk(30, "금방 깨우치니 똑똑하군。 우린 인연이 있으니 내 너에게 검법을 전수하겠다。 깨우칠지 말지는 오로지 너의 자질에 달렸노라。 이 검법은 독고구패가 창안한 독고구검이다。 모두 아홉 식으로， \"총결식\"， \"파검식\"， \"파도식\"， \"파창식\"， \"파변식\"， \"파삭식\"， \"파장식\"， \"파전식\"， \"파기식\"이다。 \"적을 이해한 뒤， 선제공격\" 이 검술의 요지다。 출수할 땐 누구나 징후를 보이지， 적이 네 왼쪽 어깨를 노린다면 눈길이 그쪽으로 쏠릴 것이다。 만약 이때 그의 칼이 오른쪽 아래에 있다면 당연히 칼을 들어 반원을 그리며 공중에서 사선으로 왼쪽을 향해 내리치겠지…", "talkname30", 0);
    Talk(35, "독고구검은 공격만 있을 뿐 후퇴란 없다！ 적이 방어하지 못하게 공격하라！", "talkname35", 1);
    DarkScence();
    LightScence();
    Talk(35, "독고구검은 정말 오묘하군요。 제가 20년 안에 독고구검을 깨우칠 수 있다면 이보다 더한 기쁨은 없을 겁니다！", "talkname35", 1);
    Talk(30, "자신을 비하하지 마라。 독고선배는 총명한 분이라 깨우치는데 중점을 두셨지。 외워선 안된다。 이 검식을 깨우친다면 지금껏 배웠던 검법을 모두 잊게 되어 적을 만나도 초식에 구애받지 않고 자유롭게 검법을 펼칠 수 있을 것이다。 열심히 연마해라。 난 이만 가보겠다。", "talkname30", 0);
    Talk(35, "태사숙님！ 이제 어디로 가시렵니까？", "talkname35", 1);
    Talk(30, "충아， 말년에 검법을 전수한 제자를 두어 기쁘기 그지없구나！ 하하하！ 하하하하！！", "talkname30", 0);
    DarkScence();
    ModifyEvent(-2, -2, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
    jyx2_ReplaceSceneObject("", "NPC/fengqingyang", "");--风清扬 
    LightScence();
    Talk(0, "영호형， 검법을 전수받은 걸 축하하오。 우리도 이만 떠납시다。", "talkname0", 1);
    AddItem(79, 1);
    LearnMagic2(35, 61, 0);
    AddAptitude(35, 10);
    AddAttack(35, 5);
    AddAptitude(0, 5);
    DarkScence();
    ModifyEvent(-2, 3, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
    jyx2_ReplaceSceneObject("", "NPC/令狐冲", "");--令狐冲
    LightScence();
do return end;
