if UseItem(137) == true then goto label0 end;
    do return end;
::label0::
    AddEthics(3);
    if JudgeEventNum(10, -1) == true then goto label1 end;
        ModifyEvent(-2, 10, -2, -2, 867, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu 启动脚本867 场景24-编号10
::label1::
        AddItemWithoutHint(137, -1);
        Talk(0, "묘 대협。 해독약을 발라줄게요。", "talkname0", 1);
        DarkScence();
        ModifyEvent(-2, -2, -2, -2, 33, -1, -1, 5216, 5216, 5216, -2, -2, -2);--by fanyu 启动脚本33，改变贴图 场景24-编号8
		jyx2_SwitchRoleAnimation("NPC/miaorenfeng","Assets/BuildSource/jyx2_SAnimationControllers/sit_on_chair.controller");
        ModifyEvent(-2, 9, 0, -2, -1, -1, -1, -1, -1, -1, -2, -2, -2);
        LightScence();
        Talk(0, "상태가 좀 어때요？", "talkname0", 1);
        Talk(3, "음！ 많이 좋아졌다。 소협。 고생 많았네。 묘가에서 필요한 게 있으면 얼마든지 가져가게。 독수약왕은 독의 대가일 뿐 아니라 의술도 훌륭하군！", "talkname3", 0);
        Talk(0, "약왕 그 노인은 이미 죽었고 해독약은 그의 제자가 만든 겁니다。", "talkname0", 1);
        Talk(3, "어쩐지。 난 과거 약왕과 충돌이 있어 그를 찾아간다는 말을 듣고 가지 말라 권고한 것이네。", "talkname3", 0);
        Talk(0, "무은 일이요？", "talkname0", 1);
        Talk(3, "여태 나 자신도 명확히 모르는 일이지。 18년 전， 난 실수로 친구에게 독 묻은 검으로 상처를 입혔지。 독이 강해서 독수약왕과 관계가 있다 싶어 그에게 연유를 묻고자 찾아갔다네。 하나 그가 부인하면서 무례하게 굴기에 결국 싸움이 벌어졌지。", "talkname3", 0);
        Talk(0, "그럼 친한 친구를 직접 죽인 셈이군요！", "talkname0", 1);
        Talk(3, "그렇네。", "talkname3", 0);
        Talk(0, "친구분의 존함이 어떻게 되죠？", "talkname0", 1);
        Talk(3, "요동의 대협 호일도。", "talkname3", 0);
        if InTeam(1) == false then goto label2 end;
        --jyx2_ReplaceSceneObject("","NPC/HuFei","1") --刷出hufei
            Talk(1, "역시 당신이 내 부친을 죽였군！", "talkname1", 1);
            Talk(3, "넌 호일도의 아들？ 좋다。 날 죽여 부친의 원한을 갚아라。", "talkname3", 0);
            Talk(0, "잠깐！ 분명 오해가 있습니다！", "talkname0", 1);
            Talk(1, "모두 자백했는데 오해라니！", "talkname1", 1);
            Talk(0, "들어보세요。 묘 대협과 호 대협 두 사람에게 무공 비급이 있다는 걸 염기가 알고서 묘 대협 칼에 독을 묻혀 두 사람이 싸울 때 어부지리를 얻는 것이었죠！ 한데 어째서 두 사람이 싸우게 되어 염기 같은 소인배의 간계에 당한 겁니까？", "talkname0", 1);
            Talk(3, "그때 우린 서로 몰랐지만 둘 다 김 선생의 은혜를 입었다네。 그래서 우린 각자 선생의 도난당한 책을 찾기로 했지…… 결국 우린 서로 책을 한 권씩 찾게 되었고， 서로의 책을 얻어 선생에게 돌려주려 했었지。 하나 우리 둘 다 강호에 명성이 꽤 있는지라， 누가 더 강한지 승부를 겨루고 싶어 했다네。 책과 관계없이 호가도법과 묘가검법 중 누가 위인지를 말이다。", "talkname3", 0);
            Talk(0, "그 대결에서 오해가 빚어졌군！ 모든 게 염기의 개수작이었군요。 염기는 처단되었으니 더 이상 악행을 저지를 수 없을 겁니다。", "talkname0", 1);
            Talk(1, "그럼 우리 호가도법이 묘가검법보다 약해서 부친이 죽었단 말이오？", "talkname1", 1);
            Talk(3, "아쉽게도 그때 내가 호일도를 찔렀을 때 나도 상처를 입었다네。 내 칼에 독이 묻었기 때문에 네 부친만 화를 입은 것이다。 그러니 누가 진정한 승자인지 아직 아무도 몰라。 이제 네가 장성했으니 호가도법을 익혀 나를 넘어서라。 호가도법을 빛내는 게 부친에 대한 나의 도리이기도 하다。 필요하면 \"비호외전\"도 가져가거라。 호가도법을 연마하면 언제든지 찾아와라。", "talkname3", 0);
            do return end;
::label2::
            Talk(0, "묘 대협， 이 사이에 큰 오해가 있습니다。", "talkname0", 1);
            Talk(3, "무슨 오해가 있지？", "talkname3", 0);
            Talk(0, "들어보세요。 묘 대협과 호 대협 두 사람에게 무공 비급이 있다는 걸 염기가 알고서 묘 대협 칼에 독을 묻혀 두 사람이 싸울 때 어부지리를 얻는 것이었죠！ 한데 어째서 두 사람이 싸우게 되어 염기 같은 소인배의 간계에 당한 겁니까？", "talkname0", 1);
            Talk(3, "그때 우린 서로 몰랐지만 둘 다 김 선생의 은혜를 입었다네。 그래서 우린 각자 선생의 도난당한 책을 찾기로 했지…… 결국 우린 서로 책을 한 권씩 찾게 되었고， 서로의 책을 얻어 선생에게 돌려주려 했었지。 하나 우리 둘 다 강호에 명성이 꽤 있는지라， 누가 더 강한지 승부를 겨루고 싶어 했다네。 책과 관계없이 호가도법과 묘가검법 중 누가 위인지를 말이다。", "talkname3", 0);
            Talk(0, "그 대결에서 오해가 빚어졌군！ 모든 게 염기의 개수작이었군요。 염기는 처단되었으니 더 이상 악행을 저지를 수 없을 겁니다。", "talkname0", 1);
            Talk(3, "너는 그의 아들의 행방을 알고 있으니， 어서 그를 데리고 나를 만나러 오너라。", "talkname3", 0);
            Talk(0, "호 형이 묘 대협을 보자마자 필사적으로 달려들까 봐 걱정됩니다。", "talkname0", 1);
            Talk(3, "아쉽게도 그때 내가 호일도를 찔렀을 때 나도 상처를 입었다네。 내 칼에 독이 묻었기 때문에 네 부친만 화를 입은 것이다。 그러니 누가 진정한 승자인지 아직 아무도 몰라。 이제 네가 장성했으니 호가도법을 익혀 나를 넘어서라。 호가도법을 빛내는 게 부친에 대한 나의 도리이기도 하다。 필요하면 \"비호외전\"도 가져가거라。 호가도법을 연마하면 언제든지 찾아와라。", "talkname3", 0);
do return end;
