ModifyEvent(-2, 46, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);--by fanyu 移除脚本，可以通过 场景26-编号46
ModifyEvent(-2, 47, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);--by fanyu 移除脚本，可以通过 场景26-编号47
ModifyEvent(-2, 48, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);--by fanyu 移除脚本，可以通过 场景26-编号48
ModifyEvent(-2, 49, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);--by fanyu 移除脚本，可以通过 场景26-编号49
ModifyEvent(-2, 50, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);--by fanyu 移除脚本，可以通过 场景26-编号50
ModifyEvent(-2, 51, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);--by fanyu 移除脚本，可以通过 场景26-编号51
ModifyEvent(-2, 52, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);--by fanyu 移除脚本，可以通过 场景26-编号52
ModifyEvent(-2, 53, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);--by fanyu 移除脚本，可以通过 场景26-编号53
ModifyEvent(-2, 54, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);--by fanyu 移除脚本，可以通过 场景26-编号54
jyx2_WalkFromTo(-1,46);
SetRoleFace(2);
Talk(0, "당신이 바로 동방불패？ '왜 여자처럼 보이지？'", "talkname0", 1);
Talk(33, "이놈아！ 묵은 빚을 갚지 못했거늘， 무슨 염치로 여기 흑목애를 올랐느냐！", "talkname33", 0);
Talk(0, "어이！ 네 분께선 잘 계셨소？ 마작 기술이 늘었는지 모르겠군， 하하。", "talkname0", 1);
Talk(27, "네가 임아행을 풀어준 애송이구나。 얼마나 잘생겼는지 한 번 보고 싶었는데 마침 잘 왔다。 기대는 안 했다만， 생각보다 평범한 얼굴이야。 사랑스러운 나의 동생 연제보다 훨씬 못생겼구나。", "talkname27", 0);
Talk(0, "흔치 않은 취향이야。 에이즈를 조심하라구。", "talkname0", 1);
Talk(27, "황종공， 내가 너희들을 항주로 보내 죄인을 잘 감시하라고 했거늘 마작이나 하고 놀았단 말이오？", "talkname27", 0);
Talk(34, "죽을죄를 졌습니다！ 부디 용서하소서。 우리 형제가 금기서화에 심취한 탓에 교활한 이자의 농간에 그만 넘어가고 말았습니다。", "talkname34", 0);
Talk(33, "교주님은 문성무덕， 인의영명 하신 분이니 저놈을 잡아 죄를 대신하게 해주옵소서。", "talkname33", 0);
Talk(26, "문성무덕 인의영명？ 뭐가 현명한 교주란 것이야？ 동방불패는 이제 성별이 없다！", "talkname26", 0);
DarkScence();
ModifyEvent(-2, 55, 1, 1, -1, -1, -1, 6078, 6078, 6078, -2, -2, -2);--by fanyu 任我行出场 场景26-编号55
jyx2_ReplaceSceneObject("", "NPC/renwoxing", "1");--任我行出场
LightScence();
Talk(0, "노인장！ 왜 그날 정정당당히 겨루지 않고 날 기습했소？", "talkname0", 1);
Talk(26, "소형제， 고맙네。 자네의 도움이 없었더라면 지금도 탈출하지 못했을거야。", "talkname26", 0);
if TeamIsFull() == false then goto label0 end;
    Talk(26, "애송아， 오늘 \"소오강호\"라는 책을 찾으러 왔겠지？ 나는 본래 너를 도와주려고 왔지만， 너의 일손이 이미 충분한 것 같으니， 나는 옆에서 너희들의 공연이나 보겠다。", "talkname26", 0);
::label0::
    if TeamIsFull() == true then goto label1 end;
        Talk(26, "\"소오강호\" 책을 찾으러 왔겠지？ 보답하는 뜻으로 내가 도와주겠네。", "talkname26", 0);
::label1::
        Talk(0, "근데 노인장은 대체 뉘시오？", "talkname0", 1);
        Talk(26, "내 정체는 동방불패에게 물어보게。 동방불패！ 규화보전을 대성한 걸 축하한다！", "talkname26", 0);
        Talk(27, "임교주！ 규화보전은 당신이 전수해 준 것이니 내 항상 고마워하고 있소。", "talkname27", 0);
        Talk(0, "이 노인네가 일월신교의 전대 교주구나！'", "talkname0", 1);
        Talk(26, "고맙다는 인사로 날 서호 바닥의 어두운 지하 동굴에 가둬 하늘을 보지 못 하게 만든 것이냐！", "talkname26", 0);
        Talk(27, "목숨은 살려 드리지 않았소？ 호호호！ 내가 물도 주지 말라고 명령했다면 여태까지 살아 있을 수는 없었을 거요。", "talkname27", 0);
        Talk(26, "잘 대접해 줘서 정말 고맙다， 절이라도 올려야겠군。", "talkname26", 0);
        Talk(27, "그렇소， 옛말에도 하늘엔 천당이 있듯 지상에는 항주가 있다고 하지 않았소？ 절경이 뛰어난 항주에서 말년을 보내게 했으니， 이 얼마나 고마운 일이요？ 호호。", "talkname27", 0);
        Talk(26, "서호 호수 바닥에서 말년을 보내게 해주어 눈물 나게 고맙구나。", "talkname26", 0);
        Talk(27, "임교주， 당신이 해 준 일은， 내 평생 잊지 않겠소。 날 중용하여 곁에 둔 것도， 본교의 보물인 규화보전을 전수해 준 일도 영원히 기억하리라。 처음에는 일월신교의 교주가 되기 위해 치밀한 계략을 짜고 그대의 충신들을 제거한 뒤 교주직에 올랐소。 만인이 우러러보는 교주가 되니 세상을 얻은 듯 기분이 좋았소。 하지만 규화보전을 연마한 뒤에는 생각이 달라졌지。 신공을 완성하니 인생의 중요함을 깨닫고 만물의 이치를 깨달았소。 지금의 난 아리따운 젊은 여인들이 부럽다오。 그렇게만 될 수 있다면 교주가 아니라 천자도 사양하리라。", "talkname27", 0);
        Talk(0, "남자도 여자도 아닌 괴물이 됐군！", "talkname0", 1);
        Talk(27, "닥쳐！ 간이 크구나！", "talkname27", 0);
        if TeamIsFull() == true then goto label2 end;
            Join(26);
::label2::
            if InTeam(26) == false then goto label3 end;
                if TryBattle(57) == true then goto label4 end;
::label3::
                    if TryBattle(54) == true then goto label5 end;
                        Dead();
                        do return end;
::label4::
::label5::
                        ModifyEvent(-2, 55, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
                        ModifyEvent(-2, 0, 1, 1, 321, -1, -1, 5910, 5910, 5910, -2, -2, -2);--by fanyu 启动脚本321，改变人物贴图 场景26-编号0
                        ModifyEvent(-2, 1, 1, 1, 321, -1, -1, 5908, 5908, 5908, -2, -2, -2);--by fanyu 启动脚本321，改变人物贴图 场景26-编号1
                        jyx2_FixMapObject("任我行战斗后","1");
						jyx2_SwitchRoleAnimation("NPC/renwoxing","Assets/BuildSource/AnimationControllers/sit_on_chair.controller");
						ModifyEvent(-2, 86, 1, 1, -1, -1, -1, 7966, 7966, 7966, -2, -2, -2);--by fanyu 启动脚本321，改变人物贴图 场景26-编号86
						jyx2_FixMapObject("东方不败战斗后","1");
						jyx2_SwitchRoleAnimation("NPC/dongfangbubai","Assets/BuildSource/AnimationControllers/Dead-FaceUp.controller");--需要改为脸朝天躺地上controller
                        LightScence();
                        if InTeam(26) == false then goto label6 end;
                            Leave(26);
::label6::                  Talk(26, "동방불패！오늘에야... 원수를 갚는구나！", "talkname26", 0);
                            Talk(27, "임교주， 난 결국… 당신에게 패했군…", "talkname27", 0);
                            Talk(26, "하하하！ 이름을 바꿔야 되겠군！", "talkname26", 0);
                            Talk(27, "일대일로 싸웠다면 날 이기지 못했을 거다。", "talkname27", 0);
                            Talk(26, "맞다， 네 높은 무공에 진심으로 탄복했다。", "talkname26", 0);
                            Talk(0, "동감이오。 귀하의 절묘한 무공은 천하제일이란 말이 아깝지 않소。", "talkname0", 1);
                            Talk(27, "두 분이 그렇게 말해 주다니 과연 호탕한 장부들이로군！ 아… 업보로다…규화보전을 연마하기 위해 스스로 궁형을 가하니 수염이 없어지고 음성과 성격도 여성처럼 변하더군… 그 후 충격으로 여자가 싫어져 첩들과 시종들을 보이는 족족 다 죽였어… 그리고… 이 내 외로움을 달래기 위해 연제에게 모든 애정을 쏟았어… 내가 여자라면 얼마나 좋았을까…… 임교주， 이제 날 죽여라！", "talkname27", 0);
                            Talk(26, "그럴 순 없지。 나도 널 죽이지 않고 조용히 행복한 말년을 보내도록 해주겠네。 하하하！ 여봐라！ 당장 끌고 가라！", "talkname26", 0);
                            Talk(27, "지독하구나！", "talkname27", 0);
                            DarkScence();
                            ModifyEvent(-2, 86, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);--by fanyu 人物离场 场景26-编号86
                            jyx2_ReplaceSceneObject("", "NPC/dongfangbubai", "");--东方不败离场
                            LightScence();
                            Talk(33, "대역 죄인을 처단하고 위명이 사해까지 퍼졌으니 천추만세！ 강호를 통일하소서！", "talkname33", 0);
                            Talk(26, "천추만세？ 가소롭다！ 하하하！！ 소형제， 이 번은 자네 공이 가장 컸다네。 여기 \"소오강호\" 책을 주겠노라。 강호인들은 이 책을 무공 비급으로 착각하지만 평범한 이야기책에 불과해。", "talkname26", 0);
                            Talk(26, "무공 비급이라면 규화보전이 응당 천하에서 으뜸일 것이다！ 하나 아무나 연마할 수 있는 게 아냐！", "talkname26", 0);
                            Talk(0, "왜죠？", "talkname0", 1);
                            Talk(26, "규화보전을 연마하기 위해선 불구가 되어야 한다。 노부는 절대 그런 멍청한 짓을 하지 않지！ 하하！ 하하하！ 하나 천하제일의 무공이라 사람들의 마음을 현속시키지。 동방불패！ 내가 규화보전을 전수한 진짜 저의를 결코 모르리라！ 내 자리를 노리고 있음을 모를 줄 알았더냐！！ 하하하！！ 하하하하！！", "talkname26", 0);
                            Talk(0, "이제 보니 순수한 마음에서 규화보전을 전수한 게 아니었구나！ '두 사람이 서로 속고 속였구나。 결국엔 둘 다 똑같은 자들이야！' 노선배， 규화보전을 빌려주실 수 있습니까？", "talkname0", 1);
                            Talk(26, "안돼！ 본교의 보물인지라 외부인에게는 줄 수 없다！ 거세를 하는 무공을 배워서 뭐 하겠나？ 욕심이 화를 부르는 법일세。", "talkname26", 0);
                            AddItem(151, 1);
                            ModifyEvent(-2, 83, 0, 0, -1, -1, 327, -1, -1, -1, -2, -2, -2);--by fanyu 启动脚本327， 场景26-编号83
                            ModifyEvent(-2, 84, 0, 0, -1, -1, 327, -1, -1, -1, -2, -2, -2);--by fanyu 启动脚本327， 场景26-编号84
                            ModifyEvent(-2, 85, 0, 0, -1, -1, 327, -1, -1, -1, -2, -2, -2);--by fanyu 启动脚本327， 场景26-编号85
                            ModifyEvent(-2, 2, -2, -2, 323, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu 启动脚本323， 场景26-编号2
                            ModifyEvent(-2, 3, -2, -2, 325, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu 启动脚本325， 场景26-编号3
                            ModifyEvent(-2, 4, -2, -2, 324, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu 启动脚本324， 场景26-编号4
                            ModifyEvent(-2, 5, -2, -2, 326, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu 启动脚本326， 场景26-编号5
                            ModifyEvent(-2, 6, -2, -2, 319, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu 启动脚本319， 场景26-编号6
                            ModifyEvent(-2, 7, -2, -2, 319, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu 启动脚本319， 场景26-编号7
                            ModifyEvent(-2, 8, -2, -2, 319, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu 启动脚本319， 场景26-编号8
                            ModifyEvent(-2, 9, -2, -2, 319, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu 启动脚本319， 场景26-编号9
                            ModifyEvent(-2, 10, -2, -2, 319, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu 启动脚本319， 场景26-编号10
                            ModifyEvent(-2, 11, -2, -2, 319, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu 启动脚本319， 场景26-编号11
                            ModifyEvent(-2, 12, -2, -2, 319, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu 启动脚本319， 场景26-编号12
                            ModifyEvent(-2, 13, -2, -2, 319, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu 启动脚本319， 场景26-编号13
                            ModifyEvent(-2, 14, -2, -2, 319, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu 启动脚本319， 场景26-编号14
                            ModifyEvent(-2, 15, -2, -2, 319, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu 启动脚本319， 场景26-编号15
                            ModifyEvent(-2, 16, -2, -2, 319, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu 启动脚本319， 场景26-编号16
                            ModifyEvent(-2, 17, -2, -2, 319, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu 启动脚本319， 场景26-编号17
                            ModifyEvent(-2, 18, -2, -2, 319, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu 启动脚本319， 场景26-编号18
                            ModifyEvent(-2, 19, -2, -2, 319, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu 启动脚本319， 场景26-编号19
                            ModifyEvent(-2, 20, -2, -2, 319, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu 启动脚本319， 场景26-编号20
                            ModifyEvent(-2, 21, -2, -2, 319, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu 启动脚本319， 场景26-编号21
                            ModifyEvent(-2, 22, -2, -2, 319, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu 启动脚本319， 场景26-编号22
                            ModifyEvent(-2, 23, -2, -2, 319, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu 启动脚本319， 场景26-编号23
                            ModifyEvent(-2, 24, -2, -2, 319, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu 启动脚本319， 场景26-编号24
                            ModifyEvent(-2, 25, -2, -2, 319, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu 启动脚本319， 场景26-编号25
                            ModifyEvent(-2, 26, -2, -2, 319, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu 启动脚本319， 场景26-编号26
                            ModifyEvent(-2, 27, -2, -2, 319, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu 启动脚本319， 场景26-编号27
                            ModifyEvent(-2, 28, -2, -2, 319, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu 启动脚本319， 场景26-编号28
                            ModifyEvent(-2, 29, -2, -2, 319, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu 启动脚本319， 场景26-编号29
                            ModifyEvent(-2, 30, -2, -2, 319, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu 启动脚本319， 场景26-编号30
                            ModifyEvent(-2, 31, -2, -2, 319, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu 启动脚本319， 场景26-编号31
                            ModifyEvent(-2, 32, -2, -2, 319, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu 启动脚本319， 场景26-编号32
                            ModifyEvent(-2, 33, -2, -2, 319, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu 启动脚本319， 场景26-编号33
                            ModifyEvent(-2, 34, -2, -2, 319, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu 启动脚本319， 场景26-编号34
                            ModifyEvent(-2, 35, -2, -2, 319, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu 启动脚本319， 场景26-编号35
                            AddEthics(4);
                            AddRepute(21);
do return end;
