Talk(43, "이 자식， 너 왜 아직까지 살아있는 것이냐？ 협객도에 가지 않았느냐？", "talkname43", 0);
Talk(0, "이미 다녀왔습니다！ 협객도는 사실 외부에서 전해지는 것처럼 그렇게 무섭지 않습니다。 섬에는 절대 무공의 비밀이 숨겨져 있죠。 많은 장문들과 무림 고수들이 무공 연구에 빠져서 중원으로 돌아가지 않고 있어요。 실종이나 살해당한 것이 아닙니다。 일의 경과는 이렇습니다。", "talkname0", 1);
Talk(43, "뭐야！ 그런 일이 있다니！그럼 너는 협객도의 신공을 배웠다는 소리구나。 어서 무공비급을 내놓아라， 그렇지 않으면 험한 꼴을 당할 것이다。", "talkname43", 0);
Talk(0, "아이고！ 언제 그랬냐는 듯 얼굴을 뒤집어 알아볼 수가 없구나！ 애초에 내가 협객도로 가서 대신 죽어준다고 할 땐 기뻐하더니， 지금은…", "talkname0", 1);
Talk(43, "어처구니 없는 소리 하지 마라。", "talkname43", 0);
if TryBattle(60) == true then goto label0 end;
    Dead();
    do return end;
::label0::
    LightScence();
    ModifyEvent(-2, 5, -2, -2, 347, -1, -1, -2, -2, -2, -2, -2, -2);
    ModifyEvent(-2, 6, -2, -2, 347, -1, -1, -2, -2, -2, -2, -2, -2);
    ModifyEvent(-2, 7, -2, -2, 347, -1, -1, -2, -2, -2, -2, -2, -2);
    ModifyEvent(-2, 8, -2, -2, 347, -1, -1, -2, -2, -2, -2, -2, -2);
    ModifyEvent(-2, 9, -2, -2, 346, -1, -1, -2, -2, -2, -2, -2, -2);
    AddRepute(3);
do return end;
