Talk(0, "선배님， 제가 준 옥봉장이 꽤 효과가 좋았죠？", "talkname0", 1);
Talk(64, "네가 준 옥봉장도 쓸모가 있었다만， 내가 벌을 기르는 기술이 더 뛰어났기 때문이야。", "talkname64", 0);
Talk(0, "에？", "talkname0", 1);
Talk(64, "천하에서 둘도 없는 신비한 벌을 만들었지。 솜씨 좋은 양봉 장인도 감히 날 따라 하지 못 할 거다。", "talkname64", 0);
Talk(0, "무슨 벌인데요？", "talkname0", 1);
Talk(64, "하나만 묻겠네。 사람은 조물주가 만든 가장 똑똑한 존재이지。 사람 말고 짐승이나 벌레의 몸에 글을 새기는 걸 본 적 있나？", "talkname64", 0);
Talk(0, "호랑이는 노랗고 까만 줄무늬가 있고， 표범은 반점이 있으며， 나비에서 독사에 이르기까지 조물주가 주신 백 가지의 무늬가 있지 않습니까？", "talkname0", 1);
Talk(64, "그럼 벌레 몸에 글을 새기는 걸 본 적이 있나？", "talkname64", 0);
Talk(0, "그런 일은 듣지도 보지도 못했습니다。", "talkname0", 1);
Talk(64, "그럼 놀라운 걸 보여주마。 벌의 날개를 잘 살펴보게。", "talkname64", 0);
Talk(0, "아！ 뭔가 새겨져 있어요！ \"아래있다\" 인 것 같아요。", "talkname0", 1);
Talk(64, "헤헤， 내 실력을 잘 보았나？", "talkname64", 0);
Talk(0, "보아하니 사람이 새긴 글씨가 분명해。' 이 게 무슨 둘도 없는 신기한 벌입니까？ 수화침으로 글을 새긴 거잖아요！", "talkname0", 1);
Talk(64, "아니라니까！ 허허 참。 다른 벌들도 보여주지。", "talkname64", 0);
Talk(0, "아니！ 벌 마다 새긴 글씨가 다 다르네요？ 이 건 \"난 절정곡\" …", "talkname0", 1);
Talk(64, "어떤 벌은 \"이오사\"라고 쓰여있고， \"일삼이\"라고 쓰인 것도 있지。 내가 어떻게 일일이 다 썼겠어？", "talkname64", 0);
Talk(0, "\"아래 있다\" ， \"난 절정곡\"， \"이오사\"， \"일삼이\" …… 이 게 무슨 무슨 말이지？ 이 벌들， 선배님이 기르신 게 아니죠？", "talkname0", 1);
Talk(64, "헛… 어떻게 알았지？", "talkname64", 0);
Talk(0, "그냥 때려 맞춘 거죠。", "talkname0", 1);
Talk(64, "이 벌들은 북쪽 산에서 갑자기 날아왔는데 처음엔 나도 깜짝 놀랐어。", "talkname64", 0);
Talk(0, "흠… 이상한 일이군요。", "talkname0", 1);
Talk(64, "아직 승복하지 않은 모양인데 더 신기한 벌을 가져올 테니 딱 기다려！", "talkname64", 0);
ModifyEvent(-2, 4, -2, -2, 406, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu|启动406脚本。场景20-编号4
ModifyEvent(-2, 5, -2, -2, 410, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu|启动410脚本。场景20-编号5
ModifyEvent(-2, 6, -2, -2, 410, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu|启动410脚本。场景20-编号6
ModifyEvent(-2, 7, -2, -2, 410, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu|启动410脚本。场景20-编号7
ModifyEvent(-2, 8, -2, -2, 410, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu|启动410脚本。场景20-编号8
ModifyEvent(-2, 9, -2, -2, 410, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu|启动410脚本。场景20-编号9
ModifyEvent(-2, 10, -2, -2, 410, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu|启动410脚本。场景20-编号10
ModifyEvent(-2, 11, -2, -2, 410, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu|启动410脚本。场景20-编号11
ModifyEvent(-2, 12, -2, -2, 410, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu|启动410脚本。场景20-编号12
ModifyEvent(21, 1, 1, 1, 417, -1, -1, 6158, 6158, 6158, -2, -2, -2);--by fanyu|启动417脚本，改变贴图。场景21-编号01
jyx2_ReplaceSceneObject("21","NPC/yinggu","1");
ModifyEvent(21, 4, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
ModifyEvent(40, 9, 1, 1, 18, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu|启动18脚本。场景40-编号09
ModifyEvent(40, 10, 1, 1, 18, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu|启动18脚本。场景40-编号10
ModifyEvent(40, 11, 1, 1, 18, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu|启动18脚本。场景21-编号11
ModifyEvent(40, 12, 1, 1, 18, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu|启动18脚本。场景21-编号12
OpenScene(80);
do return end;
