Talk(66, "애송아， 일을 잘 처리했느냐？", "talkname66", 0);
Talk(0, "이미 단황야를 만났어요。", "talkname0", 1);
Talk(66, "그를 죽였느냐？", "talkname66", 0);
Talk(0, "아뇨。", "talkname0", 1);
Talk(66, "흥！ 멍청한 놈이로군！ 본래 너를 도화도로 보내 주백통을 구하려 했는데 안되겠어。", "talkname66", 0);
Talk(0, "주백통을 구하다뇨？ 주 선배는 도화도를 떠났다고 들었습니다。", "talkname0", 1);
Talk(66, "그 게 사실이냐？", "talkname66", 0);
Talk(0, "이제 그만 복수를 포기하세요。 당신의 아들은 단황야가 죽인 게 아닙니다。", "talkname0", 1);
Talk(66, "직접 죽인 건 아니지만 어쨋든 죽인 셈이야！", "talkname66", 0);
Talk(0, "그는 당신을 정말 사랑했기에 구하지 않은 겁니다。", "talkname0", 1);
Talk(66, "흥！ 사랑？ 웃기지 마！", "talkname66", 0);
Talk(0, "당신을 사랑했기에 주백통을 질투한 거죠。 당신이 준 원앙천을 보자 후회하고 상심했지요。 내 말대로 이젠 복수를 단념해요。", "talkname0", 1);
Talk(66, "…… 좋다。 주백통을 찾아서 여기로 데려오면 책의 소재지를 말해주마。", "talkname66", 0);
Talk(0, "좋습니다。 누군가를 해하는 일만 아니라면 뭐든지 하겠어요。", "talkname0", 1);
ModifyEvent(-2, -2, -2, -2, 421, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu|启动421脚本。场景21-编号01
ModifyEvent(20, 4, -2, -2, 411, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu|启动411脚本。场景20-编号04
ModifyEvent(47, 0, -2, -2, 428, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu|启动428脚本。场景47-编号00
ChangeMMapMusic(3);
do return end;
