Talk(64, "자네군！ 자， 내가 재밌는 놀이를 가르쳐 주지。", "talkname64", 0);
Talk(0, "무공이 아니라 놀이라뇨？", "talkname0", 1);
Talk(64, "이 게 바로 노완동이 창안한 \"좌우호박기술\" 이야。 도화도에서 황노사에게 15년간 갇혀있을 때 만들어 낸 무공이지。 15년간 너무 심심해서 오른손과 왼손이 싸우는 놀이를 생각한 거야。", "talkname64", 0);
Talk(0, "왼손이 어떻게 오른손과 싸울 수 있습니까？", "talkname0", 1);
Talk(64, "왼손이 황노사， 오른손이 내가 되어 왼손이 공격할 때 오른손이 막으면서 싸우는 거지。", "talkname64", 0);
Talk(0, "배우기 어렵죠？", "talkname0", 1);
Talk(64, "그 건 사람마다 달라。 어떤 사람은 평생 못 배우고， 어떤 사람은 며칠 만에 배울 수도 있으니까。 똑똑한 사람이 더 못 배우더군。 따라 해 보라구。 왼손은 네모를 그리고， 오른손은 원을 그린다…", "talkname64", 0);
DarkScence();
LightScence();
Talk(64, "무공을 다 전수했으니 성공은 자네의 노력 여하에 달렸다네！", "talkname64", 0);
AddItem(91, 1);
ModifyEvent(-2, -2, -2, -2, 413, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu|启动脚本413。场景20-编号04
ModifyEvent(21, 3, -2, -2, -1, -1, -1, -2, -2, -2, -2, -2, -2);--by qige2016|关闭脚本432。场景21-编号03
do return end;
