Talk(66, "넌 누구길래 감히 흑룡담에 침입했느냐？", "talkname66", 0);
if InTeam(63) == false then goto label0 end;
    Talk(63, "오행기문술을 아는 자가 당신만 있는 건 아니에요。", "talkname63", 1);
::label0::
    if InTeam(63) == true then goto label1 end;
        Talk(0, "이것도 별거 아니야， 고생해서 지도 한번만 그리면 돼。", "talkname0", 1);
::label1::
        Talk(66, "여긴 왜 온 거지？", "talkname66", 0);
        Talk(0, "여기 진법이 독특하여 고인이 사시는 것 같아 특별히 조언을 구하고자 왔습니다。", "talkname0", 1);
        Talk(66, "뭘 알고 싶은 게냐？", "talkname66", 0);
        Talk(0, "십사천서를 찾기 위해 천하를 돌아다니고 있는데 혹시 행방을 아시는지요？", "talkname0", 1);
        Talk(66, "나의 복수를 돕기 위해 하늘이 이놈을 내게 보냈구나！' 원앙은 본디 한 쌍이거늘， 가엾은 늙은이여 백발이 되어 빛나고， 봄 물결과 푸른 풀은 추위에 떨며 붉은 옷을 입는구나！", "talkname66", 0);
        Talk(0, "미친 할머닌가？ 갑지기 뭐라 읊어대는 거야？ '참！ 책을 찾는 단서일지도 모른다。 빌어먹을！ 벌써 까먹었어！'", "talkname0", 1);
        Talk(66, "운이 좋은 녀석이구나。 나 영고가 \"사조영웅전\" 책의 행방을 알고 있다。 대신 일을 하나 처리해 주면 알려주겠다。", "talkname66", 0);
        Talk(0, "무슨 일이든지 말씀하세요！", "talkname0", 1);
        Talk(66, "단황야를 죽여다오。", "talkname66", 0);
        Talk(0, "단황야？ 강호에서 남제라 불리는 단황야요？", "talkname0", 1);
        Talk(66, "여기서 남쪽으로 가면 그가 사는 대나무 집이 나온다。", "talkname66", 0);
        Talk(0, "그는 절세 고수라던데 무슨 수로 이깁니까？", "talkname0", 1);
        Talk(66, "내가 너에게 손수건을 하나 줄 테니， 네가 먼저 그에게 보여줘라。 그가 방심하여 흐트러지면 아마 그를 죽일 기회가 있을 것이다。", "talkname66", 0);
        Talk(0, "단황야는 인자하여 누구에게나 존경받는 인물인데 무슨 연유로 죽이려 하죠？", "talkname0", 1);
        Talk(66, "인자하다고？ 내 아이가 죽는 걸 눈앞에서 보고도 구하지 않았어！ 싫으면 됐다！ 죽이든지 말든지 네 마음대로 해라！ 원앙은 본디 한 쌍이거늘， 가엾은 늙은이여 백발이 되어 빛나고， 봄 물결과 푸른 풀은 추위에 떨며 붉은 옷을 입는구나！ (역주 : 영고의 반복되는 대사 鸳鸯织就欲双飞。 可怜未老头先白， 春波碧草晓寒深处， 相对浴红衣。 1983년 홍콩판 사조영웅전 3부 화산논검 삽입곡 \"사장기 四張機\" 중 마지막 소절의 가사입니다。 여기서 \"사장기'는 원앙으로 수 놓은 영고의 천 조각을 뜻하는 듯 합니다。)", "talkname66", 0);
        AddItem(184, 1);
        ModifyEvent(-2, -2, -2, -2, 418, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu|启动418脚本。场景21-编号01
        ModifyEvent(47, 0, 1, 1, 425, 426, -1, 6150, 6150, 6150, -2, -2, -2);--by fanyu|启动425,426脚本，更改贴图。场景47-编号00
        jyx2_ReplaceSceneObject("47", "NPC/一灯", "1"); 
        ChangeMMapMusic(3);
do return end;
