if UseItem(184) == true then goto label0 end;
    do return end;
::label0::
    AddItemWithoutHint(184, -1);
    Talk(65, "이 건… 영고가 준 건가？ 자넬 왜 보냈지？", "talkname65", 0);
    Talk(0, "단황야에게만 말하겠습니다。", "talkname0", 1);
    Talk(65, "단황야는 사라지고 일등대사만 있네。", "talkname65", 0);
    Talk(0, "대사가 단황야군요。", "talkname0", 1);
    Talk(65, "왜 왔는지 알겠네。 영고가 손수건을 건네준 것이라면， 날 죽이러 왔겠군…", "talkname65", 0);
    Talk(0, "내 목적을 알다니 무서운 사람이야。' 대사를 죽여야만 날 돕겠다고 했기 때문이죠。 대체 무슨 원한이 있는 겁니까？", "talkname0", 1);
    Talk(65, "아！ 말하자면 길다！…… 발단은 진경을 둘러싼 화산논검에서 시작되었지。 그 해 전진교주 왕중양이 진경을 얻고자 사제 주백통과 대리국에 온 적이 있다네… 우연히 왕비 유귀비가 무공을 연마하는 모습은 본 주백통은 성격이 천진난만했기에 두 사람은 무학을 토론하며 가까워졌지… 이윽고 왕비는 주백통에서 무공을 배우게 됐고 젊은 남녀가 가까이 있다 보니 정이 생겼고 급기야는 일이 벌어졌지。 난 그 사실을 알았고， 주백통에게 부부의 연을 맺으라고 했네만 여러 사정상 절대 그럴 수 없다고 거절하며 돌아갔다네！ … 그 후로 도화도에 갇혀 있다가 얼마 후 탈출한 사실을 알게 되었네。 어느 날 밤에 왕비가 아이를 품에 안고 울면서 날 찾아왔네。 아기는 중상을 입은 상태였네…… 적의 목적이 나라는 걸 알았지만 아이를 치료하면 공력을 심하게 소모하게 되기에…… 왕비의 우는 모습이 너문나도 처량해 구하고 싶었지만 제2차 화산논검이 코앞으로 다가왔고 공력을 소모했다간 진경을 얻을 수 없기에 아이를 구해주겠단 말이 떨어지지 않았네… 진경에 눈이 멀어 자비심을 잃었던 걸세。 한참 시간이 지난 후에야 비로소 아이를 구하기로 결심했지。 아！ 난 정말 비겁한 소인배였어… 아기를 구하려는 순간 왕비와 주백통이 나웠던 정표인 원앙으로 수놓인 천이 아기를 감싸고 있는 게 보였네。 난 질투심에 진노하여 너희들이 낳은 아이니 공력을 소모하며 구해줄 수 없다고 말했지…… 결국 죄 없는 아기는 죽었어… 그 일이 있은 뒤， 사흘동안 식음을 전폐하고 깨우친 바가 있어， 왕위를 아들에게 양위하고 출가의 길을 나선 것이라네。", "talkname65", 0);
    Talk(0, "왕비가 바로 영고군요！", "talkname0", 1);
    Talk(65, "맞네， 오늘날까지 아기의 복수만을 염원했겠지。 아！ 난 죄가 깊은 몸。 매일 영고의 비수에 찔려 숨이 다하기만을 기다리고 있다네。", "talkname65", 0);
    ModifyEvent(21, 1, -2, -2, 419, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu|启动419脚本。场景21-编号01
    ModifyEvent(-2, -2, -2, -2, 427, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu|启动427脚本。场景47-编号00
    if AskBattle() == true then goto label1 end;
        Talk(0, "복잡한 사연이 있는 줄 몰랐습니다。 또 정 때문이었군요…", "talkname0", 1);
        do return end;
::label1::
        AddEthics(-1);
        if TryBattle(68) == false then goto label2 end;
            ModifyEvent(21, 1, -2, -2, 420, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu|启动420脚本。场景21-编号01
            ModifyEvent(-2, -2, -2, -2, -1, -1, -1, 6226, 6226, 6226, -2, -2, -2);--by fanyu|改变贴图。场景47-编号00
			jyx2_SwitchRoleAnimation("NPC/一灯","Assets/BuildSource/AnimationControllers/Dead.controller");
            LightScence();
            AddEthics(-10);
            AddRepute(10);
            do return end;
::label2::
            LightScence();
            Talk(65, "시주께선 돌아가서 영고에게 직접 죄값을 치르겠다고 일러주게。 여기서 기다리고 있겠네。", "talkname65", 0);
do return end;
