Talk(65, "영고가 어서 와서 날 죽이고 내 죄를 씻어주었으면…", "talkname65", 0);
Talk(0, "영고는 기쁨에 젖어서 대사님을 죽이러 오지 않을 거예요。", "talkname0", 1);
Talk(65, "어째서인가？", "talkname65", 0);
Talk(0, "이 일은 이렇게… 이렇고… 이렇습니다… 그래서 영고와 노완동 두 사람은 금이 간 거울처럼 재회한 셈이니 선배도 자책할 필요가 없습니다。", "talkname0", 1);
Talk(65, "아미타불。 좋습니다！ 시주께서 큰 공덕을 쌓으셨군요。", "talkname65", 0);
ModifyEvent(-2, -2, -2, -2, 431, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu|启动脚本431。场景47-编号00
ModifyEvent(-2, 1, -2, -2, -1, -1, 430, -2, -2, -2, -2, -2, -2);--by fanyu|启动脚本430。场景47-编号01
do return end;
