Talk(0, "노선배님！ 냄새가 좋은데 뭘 드세요？", "talkname0", 1);
Talk(69, "영양 많은 영양탕이다。 나 혼자 먹기도 모자라니 국물도 없는 줄 알아！", "talkname69", 0);
Talk(0, "검정개인가요？ 검정개가 맛이 좋다던데。", "talkname0", 1);
Talk(69, "맛을 아는구나。 그렇다。 \"일흑이황삼화사백\" 동물은 검정 고기가 제일 맛있는 법이지！ 하지만 황용이 만든 요리와는 비교도 안 된다。 그 애가 만든 \"옥적수가청락매\" 는 생각만 해도 군침이 도는구나。", "talkname69", 0);
ModifyEvent(-2, -2, -2, -2, 461, 462, -1, -2, -2, -2, -2, -2, -2);--by fanyu 启动脚本461,462 场景23-编号0
ModifyEvent(32, 0, -2, -2, 675, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu 启动脚本675 场景32-编号0
do return end;
