Talk(0, "후배가 곽 대협， 황 여협을 뵙습니다。", "talkname0", 1);
Talk(56, "\"사조영웅전\" 을 찾으러 왔겠지？", "talkname56", 0);
Talk(0, "황 여협은 강호의 제갈공명이란 소문이 과연 맞군요。 머나먼 도화도까지 온 건 \"사조영웅전\" 이란 책을 찾기 위해서죠。", "talkname0", 1);
Talk(56, "오느라 고생이 많았군。", "talkname56", 0);
Talk(0, "\"사조영웅전\" 을 찾을 수 있다면 고생쯤이야 아무런 문제가 되지 않아요。", "talkname0", 1);
Talk(55, "그 책은 우리 부부가 갖고 있다。 주는 건 어렵지 않은 일이네。", "talkname55", 0);
Talk(0, "곽 대협과 황 여협께 감사드립니다。", "talkname0", 1);
Talk(55, "방금 자네는 날 대협이라 불렀는데， 강호인들이 왜 날 대협이라 부르는지 아는가？", "talkname55", 0);
Talk(0, "그건 곽 대협의 높은 무공과 항룡십팔장의 위력이 널리 퍼졌기 때문이죠。", "talkname0", 1);
Talk(55, "왜 우리가 무공을 연마해야 하는지 다시 묻겠다。", "talkname55", 0);
Talk(0, "무공이 강해야만 상대를 제압할 수 있고 뜻하는 바를 이룰 수 있기 때문이죠。 나쁜 짓을 하는 게 아니라 무공이 높아야만 정의를 실현할 수 있는 겁니다。", "talkname0", 1);
Talk(55, "왜 무공을 배울까？ 정의를 실현하는 것은 작은 일에 속하는 것이네。 내가 곽 대협이라 불리는 이유는 목숨 바쳐 양양성을 사수해 나라와 백성을 지켜냈기 때문이다。 나라를 지키지 못한다면 대협이 아닐세。 자넨 똑똑한 사람이니 나보다 잘 할 것이라 믿네。 나라와 백성을 위함이 대협의 기본임을 명심하게。 그래야만 존경받고 성망 있는 진짜 대협이 된다네。", "talkname55", 0);
Talk(0, "……", "talkname0", 1);
Talk(55, "대협의 면모를 보일 수 있다면 이 책을 당장이라도 내어주겠네。 아니면 날 이겨야만 가질 수 있을 걸세。 수련을 위해 한 가지 물건을 주지。 주방에 있는 상자를 열면 도화도의 특수약이 들어있을 거다。 갖고 가면 반드시 도움이 될 걸세。", "talkname55", 0);
if JudgeEventNum(3, -1) == true then goto label0 end;
    ModifyEvent(-2, 3, -2, -2, 924, -1, -1, -2, -2, -2, -2, -2, -2);
::label0::
    if JudgeEventNum(4, -1) == true then goto label1 end;
        ModifyEvent(-2, 4, -2, -2, 925, -1, -1, -2, -2, -2, -2, -2, -2);
::label1::
        Talk(0, "……", "talkname0", 1);
        if JudgeEthics(0, 90, 100) == false then goto label2 end;
            Talk(55, "강호에서의 자네 명성은 귀가 따갑도록 들었네。 자！ 이 책을 가져가게。", "talkname55", 0);
            AddItem(148, 1);
            ModifyEvent(-2, 1, -2, -2, 467, -1, -1, -2, -2, -2, -2, -2, -2);
            ModifyEvent(-2, 2, -2, -2, 468, -1, -1, -2, -2, -2, -2, -2, -2);
            do return end;
::label2::
            ModifyEvent(-2, 1, -2, -2, 469, -1, -1, -2, -2, -2, -2, -2, -2);
            ModifyEvent(-2, 2, -2, -2, 475, -1, -1, -2, -2, -2, -2, -2, -2);
            Talk(55, "대협이 될 건지， 단순히 천하제일이 될 건지는 자네의 행동에 달려있네。", "talkname55", 0);
do return end;
