if UseItem(130) == true then goto label0 end;
    do return end;
::label0::
    AddEthics(2);
    AddItemWithoutHint(130, -1);
    Talk(0, "모용 공자， 대연국 전국옥새를 갖고 왔소。", "talkname0", 1);
    Talk(51, "진짜 찾았군！ 대연국을 수복할 수 있겠어。", "talkname51", 0);
    Talk(0, "약속을 이행했으니 이젠 \"천룡팔부\"가 어디 있는지 말해주시오。", "talkname0", 1);
    Talk(51, "옥새만으로는 나 모용복의 신분을 증명하지 못해。 내 명령에 따르지 않을거야… 맞아！ 대연황제도표가 어딨지？", "talkname51", 0);
    Talk(0, "대연황제도표까지 찾으라는 말은 하지 않았소。", "talkname0", 1);
    Talk(51, "도표가 없으면 내가 왕가의 후손임을 증명할 수 없다。 도표를 찾아와야만 \"천룡팔부\"가 어딨는지 말해주겠다。", "talkname51", 0);
    Talk(109, "오라버니， 약속을 지키세요！ 한 번 내뱉은 말을 어길 순 없어요。 차라리 내가 말할게요。", "talkname109", 0);
    Talk(51, "감히！", "talkname51", 0);
    Talk(109, "……", "talkname109", 0);
    Talk(0, "왕낭자를 난처하게 할 순 없어。' 다시 한번 믿어보지。 도표를 찾아올 테니 이 번엔 신의를 꼭 지켜라！", "talkname0", 1);
    Talk(51, "좋다。 그래도 고생은 했으니 유명한 기서를 주겠다。 열쇠를 줄 테니 내 방 상자에서 꺼내가라。", "talkname51", 0);
    ModifyEvent(-2, -2, -2, -2, 572, 573, -1, -2, -2, -2, -2, -2, -2);
    AddItem(166, 1);
do return end;
