Talk(0, "실례지만 스님， 여기가 소림사인가요？", "talkname0", 1);
Talk(96, "맞소。", "talkname96", 0);
Talk(0, "무학의 전당이요！ 무협소설에 꼭 등장하는 소림사구나！ 어서 구경해야지。", "talkname0", 1);
Talk(96, "방장님은 오대파와 광명정을 공격하러 출정 나가 여태 안 돌아왔소。 시주님！ 하산하시죠。", "talkname96", 0);
ModifyEvent(-2, 3, -2, -2, 521, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu启动脚本521，场景28-3
ModifyEvent(-2, 4, -2, -2, 521, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu启动脚本521，场景28-4
ModifyEvent(-2, 5, -2, -2, 521, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu启动脚本521，场景28-5
ModifyEvent(-2, 6, -2, -2, 521, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu启动脚本521，场景28-6
do return end;
