Talk(70, "닥치지 못할까！", "talkname70", 0);
if InTeam(51) == true then goto label0 end;
    Talk(70, "소협은 선행을 많이 베푸시오。", "talkname70", 0);
    do return end;
::label0::
    jyx2_ReplaceSceneObject("", "NPC/慕容复", "1");--慕容复
    Talk(51, "대사！ 우리는 한가지 물건을 빌리러 왔소。", "talkname51", 1);
    Talk(70, "시주께선 노승에게 무엇을 빌린다는 것이오？", "talkname70", 0);
    Talk(51, "어떤 서찰 한 통。", "talkname51", 1);
    Talk(70, "서찰 한 통？", "talkname70", 0);
    Talk(51, "그렇소， 서찰 말이오。 당시 무림선배들이 공동으로 비밀을 적어 둔 서찰！ 개방 방주 교봉이 한인이 아니라 오랑캐임을 증명할 수 있는 서찰！", "talkname51", 1);
    Talk(70, "시주는 누구시오？", "talkname70", 0);
    Talk(51, "고소 모용복！", "talkname51", 1);
    Talk(70, "모용복， 그 사실을 어떻게 아느냐？", "talkname70", 0);
    Talk(51, "나는 당연히 알고 있소。", "talkname51", 1);
    Talk(70, "그래， 틀림없이 그 사람이 너에게 알려준 거야。", "talkname70", 0);
    Talk(0, "모용 공자， 이게 대체 어떻게 된 일이오？ 무슨 한인？ 오랑캐？", "talkname0", 1);
    Talk(51, "넌 모를 거다。 무림인이 존경하는 개방 방주 교봉 대협이 사실 한인이 아니라 한족을 개처럼 죽이는 오랑캐라는 걸 아는 자가 거의 없을 거다。 옛날 현자 방장이 군웅들을 이끌고 오랑캐 한 명을 실수로 죽였다。 방장은 죄책감에 오랑캐가 남긴 핏덩이를 몰래 소림사에서 기르기로 했지…… 후에 그 아이는 개방 방주가 됐고 그가 바로 교봉이다。 하나 교봉의 속에 잠재 된 오랑캐의 성격이 나타나 무림에 해를 끼칠까 봐 걱정한 군웅들은 교봉의 진짜 신분을 서찰에 적어 증명해 놓았지。 오랑캐의 야만성이 드러날 때 중원 군웅들이 합세하여 그의 신분을 폭로하고 제거할 수 있도록 말이지。 아버지의 전처를 밟도록 말이다。 그래서 오늘 우리는 서찰만 손에 넣으면， 교봉은 무림에서 사라지게 된다。 자네도 그토록 원하던 천룡팔부를 얻게 될 거야。", "talkname51", 1);
    Talk(70, "아미타불！ 교봉의 부친을 실수로 죽인 건 사실이오。 교봉은 정의롭고 어떠한 한인보다도 훨씬 뛰어나오。 노승은 절대 서찰을 내어 줄 수 없소이다。", "talkname70", 0);
    Talk(51, "방장， 나중에 후회하지 마시오！ 형제！ 내가 지금 같이 온 이유를 곧 알게 될 거다。 방장， 엽이모을 기억하겠지요？ 자운동에서의 밀회！ 산파 교파파를 기억하시오！ 말해 보시오！", "talkname51", 1);
    Talk(70, "아니！ 그 사실을… 어떻게… 알았으냐…… 어떻게…", "talkname70", 0);
    Talk(51, "나는 아직 더 많은 것도 알고 있소。 계속 말할까요？", "talkname51", 1);
    Talk(70, "그만하게…", "talkname70", 0);
    Talk(51, "그럼 서찰은？", "talkname51", 1);
    Talk(70, "하나……아이고！… 가져가거라…", "talkname70", 0);
    Talk(51, "형제， 됐어。 우리는 이제 개방으로 가서 교봉의 정체를 폭로하자。", "talkname51", 1);
    Talk(70, "아미타불！ 시주는 자비심을 베푸시오…", "talkname70", 0);
    jyx2_ReplaceSceneObject("", "NPC/慕容复", "");--慕容复
    ModifyEvent(-2, -2, -2, -2, 512, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu 启动脚本512 场景28
    AddItem(183, 1);
    ModifyEvent(-2, 0, -2, -2, -1, -1, 514, -2, -2, -2, -2, -2, -2);--by fanyu 启动脚本514 场景28-0
    ModifyEvent(-2, 1, -2, -2, -1, -1, 514, -2, -2, -2, -2, -2, -2);--by fanyu 启动脚本514 场景28-1
    ModifyEvent(-2, 2, -2, -2, -1, -1, 514, -2, -2, -2, -2, -2, -2);--by fanyu 启动脚本514 场景28-2
do return end;
