Talk(0, "교방주님！ 사람들 말로는 \"천룡팔부\" 책을 가지고 계신다던데 사실입니까？", "talkname0", 1);
Talk(50, "그렇다네。", "talkname50", 0);
Talk(0, "혹시 빌려주시겠습니까？ 제 미래와 밀접하게 연관된 책입니다。", "talkname0", 1);
Talk(50, "소협， 우리 개방의 절기를 알고 있는가？", "talkname50", 0);
Talk(0, "소문에 의하면 개방의 항룡십팔장은 그 위력이 천하제일이라 들었습니다。", "talkname0", 1);
Talk(50, "맞다。 개방은 \"용\" 자와 인연이 깊기에 선배님들께선 \"천룡팔부\" 책을 마치 개방의 보물처럼 간직하셨지。 난 개방의 방주이거늘 어찌 외인에게 보물을 내어 줄 수 있겠나？", "talkname50", 0);
Talk(0, "그렇다면… 방도가 있겠습니까？", "talkname0", 1);
Talk(50, "방법이 있네。 \"천룡팔부\"의 원래 주인이 개방이 아니란 걸 알고 있으니 개방의 규칙에 따라 항룡십팔장을 막아낸다면 개방의 보물을 가질 자격이 생긴다네。", "talkname50", 0);
Talk(0, "그렇다면…", "talkname0", 1);
Talk(50, "자네가 날 이길 수 있다면 당장이라도 \"천룡팔부\"를 내어주겠네。 결정하면 말을 하시게。", "talkname50", 0);
ModifyEvent(-2, -2, -2, -2, 528, -2, -1, -2, -2, -2, -2, -2, -2);--by fanyu 启动脚本528 场景51-14
do return end;
