if UseItem(195) == true then goto label0 end;
    do return end;
::label0::
    Talk(0, "묘를 파보자。 좀비가 나올까 무섭군！", "talkname0", 1);
    PlayAnimation(-1, 6704, 6714);
    PlayAnimation(-1, 6704, 6714);
    PlayAnimation(-1, 6716, 6742);
    PlayAnimation(-1, 6716, 6742);
    PlayAnimation(-1, 6716, 6742);
    PlayAnimation(-1, 6716, 6742);

    --缺少timeline
    --jyx2_PlayTimeline("[Timeline]ka564_小虾米破庙挖坟", 0, false);
    jyx2_PlayTimelineSimple("[Timeline]ka564_小虾米破庙挖坟", true)
    jyx2_Wait(5.2)
    --jyx2_StopTimeline("[Timeline]ka564_小虾米破庙挖坟");

    DarkScence();
    ModifyEvent(-2, -2, -2, -2, 565, -1, -1, 6698, 6698, 6698, -2, -2, -2);
    jyx2_ReplaceSceneObject("","Dynamic/Tomb", "0")
    jyx2_ReplaceSceneObject("","Dynamic/Tomb_2", "1")
    PlayAnimation(-1, 6702, 6702);
    LightScence();

    Talk(0, "아！ 도굴도 힘든 일이었구나。 그래도 소득은 있으니 다행이야。 이 게 뭐지？ 이상한 글자만 적혀있군， 책 표지에 \"광릉산\"？ (역주 : 1. 채옹은 후한 말의 대신。 삼국지의 그 채옹이 맞습니다。 채옹은 실제로 시대를 대표하는 고금 연주의 기재였다고 합니다。 2. 광릉산금곡은 실제로 사마천의 \"사기\" 중 섭정이라는 인물의 이야기를 담은 고금연주곡이라고 합니다。 3. 악곡 소실에 관한 설정 : 형산파의 유정풍이 \"광릉산금곡은 동진시대(317년~420년) 이후 소실되었다， 아마 그 이전의 시대의 유물(무덤)이라면 남아있는 악보가 있을 것이다。\"라는 말을 합니다。 실제 광릉산은 위진교체기(265년 내외) 죽림칠현의 혜강이라는 자가 종요의 아들 종회에게 처형될 때， 혜강이 처형 전 실제로 직접 광릉산을 연주하며 “종원효！ 네가 이 곡을 배우고자 하였으나 가르쳐주지 않았는데， 이제 지금 이 곡이 끊어지게 되었구나！”라고 종회에게 말했다고 합니다。 여기서 광릉산의 소실 설정이 나온 것이며， 김용 선생님의 역사적 고증이 얼마나 철저했는지 알 수 있습니다。 하지만 극 중 내용과는 다르게 실제 광릉산금곡은 민간에 떠돌던 악보를 수나라(581년~619년) 때 황궁에서 보관하기 시작했고， 당나라 황궁에서 보관하다 다시 소실， 민간에 떠돌던 악보를 천 년이 지난 명나라 초기에 재보전하여 현재까지 명맥을 유지하고 있다고 합니다。 실제로 \"광릉산금곡\"의 현대판 버전을 유튜브에서 감상하실 수 있습니다。)", "talkname0", 1);
    AddItem(177, 1);
    ModifyEvent(-2, -2, -2, -2, 565, -1, -1, -2, -2, -2, -2, -2, -2);
do return end;
