Talk(0, "형제， 당신은 누군데 이곳에 갇혀 있소？", "talkname0", 1);
Talk(37, "소형제， 왜 불운한 사나이 적운을 구하는 겁니까？", "talkname37", 0);
Talk(0, "음… 대머리들과 싸우다 보니 여기까지 오게 된 거요。", "talkname0", 1);
Talk(37, "거기 형제여， 어서 떠나시오！ 나와 있으면 당신도 불운해집니다！", "talkname37", 0);
Talk(0, "형제는 왜 그런 말을 하는 거요？ 비록 내가 얼떨결에 형제를 구했다고는 하나， 강호에선 서로서로 돕고 살아야죠。", "talkname0", 1);
Talk(37, "하지만… 하지만……", "talkname37", 0);
Talk(0, "대체 무슨 일을 겪었는지 들어나 봅시다。", "talkname0", 1);
Talk(37, "몇 년 전， 사부님과 사매와 함께 만진산 사숙의 생신잔치에 갔었소。 만 가의 사람들은 내가 도적들과 결탁하여 만 가의 보물을 훔치고 사모님을 겁탔했다는 누명을 씌웠지。 관가에선 조사조차도 하지 않고 감옥에 날 가뒀네… 그 후， 사부님은 돌아가시고 사매는…… 만 사형에게 시집을 갔지…", "talkname37", 0);
Talk(0, "사매를 사랑했군。", "talkname0", 1);
Talk(37, "사매가 어떻게……만 가에 시집갈 줄이야…", "talkname37", 0);
Talk(0, "그 후론 어떻게 됐죠？ 왜 여기에 갇히게 됐나요？", "talkname0", 1);
Talk(37, "감옥에 같이 있던 정전， 정 형님이 강호일을 많이 가르쳐주셨다。 \"신조경\"이란 대법 무공도 전수해 주셨지。 어느 날， 정형님이 연인을 만나야 한다길래 같이 탈옥했는데 형님의 연인은 죽은 후였소。 형주 현관이었던 그녀의 부친은 형님이 그녀의 관을 다시 열어 볼 걸 알고서는 형님을 죽이기 위해 관에다 독을 발랐어。 결국 형님도 중독되어 죽고… 난 우여곡절 끝에 탈출했지만 어쩌 다보니 괴승에게 잡혀 이곳에 갇히게 된 거네。 나와 같이 있는 사람들은 모두 화를 당해。 어서 여길 떠나시오！", "talkname37", 0);
Talk(0, "그런 말 마쇼！ 재수가 없었을 뿐인었던 거요。", "talkname0", 1);
Talk(37, "고향 상서 마계포에 돌아가고 싶어！ 거기엔 사매와 자주 놀러 가던 동굴이 하나 있네。", "talkname37", 0);
Talk(0, "경치가 좋다면 나도 한 번 가보고 싶군。", "talkname0", 1);
Talk(37, "외진 곳에 있어서 보통 사람들은 찾기가 어려워。 맞아！ 바로 옆의 바위에 \"３６４，２７９\"라는 숫자가 있었네。", "talkname37", 0);--原版为２７０，１１５唐诗山洞
ModifyEvent(-2, -2, -2, -2, 600, -1, -1, -2, -2, -2, -2, -2, -2);
if AskJoin () == true then goto label0 end;
    do return end;
::label0::
    Talk(0, "적 형， 같이 길을 떠나자。 서로에게 도움이 될 것이오！", "talkname0", 1);
    if JudgeEthics(0, 60, 100) == true then goto label1 end;
        Talk(37, "안돼！ 나와 있으면 화를 당할 거야！", "talkname37", 0);
        do return end;
::label1::
        if TeamIsFull() == false then goto label2 end;
            Talk(37, "형제의 일행이 많아서 내가 낄 자리가 없겠군。", "talkname37", 0);
            do return end;
::label2::
            Talk(37, "좋아！ 이 불행한 나 때문에 화를 당하는 게 두렵지 않다면。", "talkname37", 0);
            DarkScence();
            ModifyEvent(-2, -2, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);--by fanyu|狄云加入队伍。场景08-编号08
            ModifyEvent(-2, 9, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
            ModifyEvent(-2, 10, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
            jyx2_ReplaceSceneObject("", "NPC/狄云", ""); 
            LightScence();
            Join(37);
            AddEthics(3);
do return end;
