if UseItem(159) == true then goto label0 end;
    do return end;
::label0::
    AddEthics(2);
    AddItemWithoutHint(159, -1);
    Talk(112, "이건… 코란경！ 소협， 코란경을 되찾으셨군요！ 자비로운 알라신이여， 알라신은 우리의 위대한 주인이옵니다。 바치옵고 평생 따르겠나이다。 성물을 되찾아주셔서 고마워요。 부족 사람들을 대신해 감사드리겠습니다。", "talkname112", 0);
    Talk(0, "멋있게 말해야지！' 별일 아닙니다。 사실 전 책 찾기 전문갑니다。", "talkname0", 1);
    Talk(112, "소협도 책을 찾고 계시다 했죠？", "talkname112", 0);
    Talk(0, "맞소！ 잃어버린 책이 있어서 찾는 중이죠。", "talkname0", 1);
    Talk(112, "저에게 책이 한 권 있는데， 혹시 소협께서 찾는 물건이 맞으신가요？", "talkname112", 0);
    Talk(0, "무슨 책이죠？", "talkname0", 1);
    Talk(112, "책 제목이 뭐였더라… \"서검은구록\" 이요。", "talkname112", 0);
    Talk(0, "아니！ 내가 바로 찾는 책들 중에 한 권인데…", "talkname0", 1);
    Talk(112, "잘 됐군요。 진 공자가 주신 책인데 별로 재미가 없다 셔서 제가 보관을 해드리고 있었죠。 원하신다면 소협께 드리겠어요。", "talkname112", 0);
    Talk(0, "뭐라고？ 이 명작이 재미없다니， 무식한 자로군！ '흥！ 진가란 놈이 이 수준 높은 명작을 어찌 읽겠어？'", "talkname0", 1);
    Talk(112, "이 얘기를 하니， 진 공자가 생각나는군요。 일을 마치고 돌아온다고 했는데 왜 늦으실까요？", "talkname112", 0);
    Talk(0, "와！ 뭐야， 희망이 없는 건가？ 진가 놈이 나보다 잘생기진 않았겠지？'", "talkname0", 1);
    Talk(112, "혹시 진가락이라는 사람을 만나면 취우 황삼이 기다린다고 전해주세요。", "talkname112", 0);
    Talk(0, "좋소， 전해주겠소！ '어림없지！'", "talkname0", 1);
    Talk(112, "소협， 잘 지내세요。", "talkname112", 0);
    AddItem(152, 1);
    ModifyEvent(-2, -2, -2, -2, 623, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu|启动脚本623。场景17
    ModifyEvent(-2, 1, -2, -2, 626, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu|启动脚本626。场景17-编号1
    ModifyEvent(-2, 2, -2, -2, 626, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu|启动脚本626。场景17-编号2
do return end;
