Talk(0, "이런 외진 곳에 있는 객잔이 이렇게 장사가 잘 될 줄은 몰랐군！", "talkname0", 1);
Talk(106, "그저 그렇소。 부근 100리 안에는 객잔이 여기 한 곳 뿐이오。 대설원에서 얼어 죽지 않으려면 여기서 하룻밤 묵는 게 좋아요。 이 공자가 머나먼 대설원까지 오신 목적은 \"북추\" 에게 해답을 얻기 위해선가요？ 아니면 비호에게서 책을 얻으려는 건가요？", "talkname106", 0);
Talk(0, "북추？ 비호？", "talkname0", 1);
Talk(106, "네！ 여기 온 사람들은 미치광이 북추에게 무림 비밀을 물으려는 자들이죠。 아니면 설산비로 호비가 갖고 있는 \"십사천서\" 를 노리던가！ 모두들 \"설산비호\" 책을 그 자가 갖고 있다고 떠들더군요。", "talkname106", 0);
Talk(0, "점소이， 너 정말 많이 안다。", "talkname0", 1);
Talk(106, "점소이가 소식통이란 걸 모르는군요。 아니면 어떻게 점소이라고 할 수 있겠어요？ 오늘은 기분이 좋으니 몇 가지 더 알려주죠。 북추는 서북쪽에 살고 있고， 호비는 북동쪽에 살고 있어요。 요즘 주민들이 산속에서 자주 실종되니까 설괴를 조심하세요。", "talkname106", 0);
Talk(0, "정말 고맙네！", "talkname0", 1);
do return end;
