if UseItem(191) == true then goto label0 end;
    do return end;
::label0::
    AddItemWithoutHint(191, -1);
    Talk(0, "사 선배님， 성곤의 수급입니다。 악핵을 많이 저질러 하늘이 천벌을 내렸습니다！", "talkname0", 1);
    Talk(13, "그래？ 하하하！ 사악함이 극에 달해 하늘도 저버렸구나！ 아쉽다… 내가 처치했어야 했는데……", "talkname13", 0);
    Talk(0, "이제 성곤에게 복수가 끝났으니 어서 중원으로 돌아가 명교의 분열을 막아야 합니다。", "talkname0", 1);
    Talk(13, "소협이 나를 위해 고생을 많이 했군。 감격하기 그지없네。 난 일을 끝낸 후 명교로 돌아가겠다。 그때 우리 명교를 방문해 주기 바란다。 아아！ 성곤이 죽었으니 도룡도는 쓸모가 없어졌구나！ 도룡도를 너에게 주마。 소협의 도움이 없었다면 명교는 이미 분열됐을 것이네。 후에 찾아오면 극진히 대접하겠네。 안녕히！", "talkname13", 0);
    AddItem(117, 1);
    ModifyEvent(-2, -2, -2, -2, 66, -1, -2, -2, -2, -2, -2, -2, -2);
    ModifyEvent(-2, 3, -2, -2, -1, -1, 67, -2, -2, -2, -2, -2, -2);

do return end;
