if UseItem(174) == true then goto label0 end;
    do return end;
::label0::
    AddItemWithoutHint(174, -1);
    Talk(106, "손님， 이게 무슨 짓이에요？ 분부하실 일이 있으면 해드리겠어요。", "talkname106", 0);
    Talk(0, "그렇게 나올 줄 알았지！' 알고 있는 사실을 모두 말해주거라。", "talkname0", 1);
    Talk(106, "이봐요， 나리！ 농담 마세요。 난 남현북추가 아닌데 어떻게 알겠어요？", "talkname106", 0);
    Talk(0, "남현북추가 누구지？", "talkname0", 1);
    Talk(106, "남현북추를 모른다니 외지에서 오셨군요。 남현은 위로는 천문 아래로는 지리까지 모르는 게 없대요。 무림 일도 손바닥 보듯 훤히 안다더군요。 영남에 살기 때문에 남현이라 부르죠。 그리고 북추는… 경극 단원 출신인데 비록 미쳤지만 무림 비밀을 알고 있다고 말하죠。 그를 만난 사람들은 미쳤다고 욕하는 자와 귀신처럼 맞춘다고 칭찬하는 두 부류에요。 북쪽에 살고 미친 사람 같기에 북추라고 부르죠。", "talkname106", 0);
    Talk(0, "남현？ 북추？ 우선 남현을 찾아가 단서를 물어야겠다。' 남현이 어디 사는가？", "talkname0", 1);
    Talk(106, "찾기 쉬워요。 서남쪽으로 계속 가면 만나게 됩니다。 하나 길이 멀어서 잘못하면 길을 잃을 수 있죠。 길에서 특이한 원형 표시를 보면 남현의 거처가 가까운 곳에 있어요。", "talkname106", 0);
    Talk(0, "그렇게 많이 알면서 아무것도 모른다고 거짓말을 해？", "talkname0", 1);
    Talk(106, "천만에요。 저도 주워들은 거예요。 이 일을 하려면 정보를 알고 있어야 되죠。 전 더이상 할 말이 없어요。 주인장에게 혼나기 전에 일해야겠어요。", "talkname106", 0);
    ModifyEvent(-2, -2, -2, -2, 667, -1, -1, -2, -2, -2, -2, -2, -2);
do return end;
