Talk(79, "다섯째야！ 이 같은 추위에 독한 술과 토끼 안주가 있으면 금상첨화지！ 안 그런가？", "talkname79", 0);
Talk(79, "형님， 이 엄동설한에 어디서 토끼를 잡아요？", "talkname79", 4);
Talk(79, "허튼소리！ 누가 토끼가 없다고 하던가。 우리가 토끼 잡을 실력이 없는 것이겠지！ 나는 일찍이 북쪽 지역의 끝에 대단한 사냥꾼이 있는데， 경공이 매우 높고 눈밭에서 토끼를 사냥하는 것이 마치 독수리처럼 빠르고 정확하다는 말을 들었다。", "talkname79", 0);
Talk(79, "그럼 뭘 더 기다려요， 그 사람의 집에 찾아가서 토끼 사냥을 부탁합시다。", "talkname79", 4);
Talk(79, "누군지 안다면 그런 말을 못 할 거다。 그 자가 사는 곳은 바로， \"운학애\" 란다。 경공 실력이 없으면 올라갈 수조차 없어。", "talkname79", 0);
Talk(79, "운학애？ 설마…", "talkname79", 4);
Talk(79, "맞아， 그 4대 악인 중 한 명인 운중학。", "talkname79", 0);
Talk(79, "그럼… 안주 없이 술만 마시도록 하죠…", "talkname79", 4);
do return end;
