Talk(0, "와， 맛있는 냄새！ 이렇게 오랫동안 밖에 떠돌다가 이 냄새를 맡으니 엄마가 그리워지는군。", "talkname0", 1);
Talk(75, "사양하지 말고 맛 좀 보게。 먹고 싶은 게 있으면 임 주방장에게 말만 해라。", "talkname75", 0);
Talk(0, "선배가 만든 요리는 모두 맛이 일품이네요！", "talkname0", 1);
Talk(75, "사실 요리의 비결은 간단하다。 정성이 손끝에서 우러나오면 맛이 좋아지지。", "talkname75", 0);
Talk(0, "음식 맛은 손맛？ '광고에서 많이 듣던 말인데。'", "talkname0", 1);
Talk(75, "그렇다。 훌륭한 요리사는 요리의 맛과 모양만 따질 게 아니라 사람들이 좋아하는 맛이 무엇인지 알아야 하지。 요리는 장식용이 아니라 사람들이 직접 먹어야 하기 때문이야。 어쨌든 요리사는 음식을 맛있게 먹어주는 손님을 항상 먼저 생각해야 한다네。", "talkname75", 0);
Talk(0, "그럼 임 사부가 가장 잘하는 요리는 무엇인가요？", "talkname0", 1);
Talk(75, "다 말할 수도 없어。 하나씩 말하자면 배추볶음， 두부튀김， 계란찜， 고기마늘볶음……。", "talkname75", 0);
Talk(0, "모두 평범한 요리들뿐이네요。", "talkname0", 1);
Talk(75, "젊은이， 훌륭한 요리사는 평범한 요리에서 진가가 발휘되는 법일세。 마치 무공과도 같아。 평범한 무공에서 신기를 펼칠 수 있는 자가 진정한 고수가 아닐까？", "talkname75", 0);
Talk(0, "……", "talkname0", 1);
Talk(75, "잘 생각해 보게。 이치를 안다면 무학에도 큰 도움이 될 걸세！", "talkname75", 0);
ModifyEvent(-2, -2, -2, -2, 674, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu 启动脚本674 场景32-编号0
AddAptitude(0, 3);
do return end;
