Talk(0, "임 사부님！ 부탁이 하나 있습니다。", "talkname0", 1);
Talk(75, "뭣인가？", "talkname75", 0);
Talk(0, "혹시 이 요리를 만들 줄 아세요？", "talkname0", 1);
Talk(75, "무슨 요리？", "talkname75", 0);
Talk(0, "\"옥적수가청락매\"", "talkname0", 1);
Talk(75, "\"옥적수가청락매\" 라면， 도화도의 간판 요리인데？ 만드는 과정이 힘들지만 나라면 할 수 있지！", "talkname75", 0);
Talk(0, "정말요？ 야호！", "talkname0", 1);
Talk(75, "하나 이 요리는 여러 재료가 필요한데， 지금 이곳엔 없어。", "talkname75", 0);
Talk(0, "무슨 재료죠？ 말씀하시면 구해올게요。", "talkname0", 1);
Talk(75, "잘 듣게나。 첫째， 양고기 양양좌둔。 둘 째， 돼지귓살。 셋 째， 소의 허릿살。 넷째， 노루 다리 장퇴육。 다섯 째는 토끼고기지。 위의 재료 중에 한 가지라도 빠지면 안 돼。 재료를 구해오면 원하는 요리를 만들어 주마。", "talkname75", 0);
ModifyEvent(-2, -2, -2, -2, 676, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu 启动脚本676 场景32-编号0
do return end;
