Talk(85, "여섯째야！ 근처에 놀기 좋은 곳이 있나？", "talkname85", 0);
Talk(85, "사형！ 강남에 왔으니 항주 서호를 구경해야죠！ 항주는 경치가 아름답기로 유명하고 또한 미인도 많대요。", "talkname85", 4);
Talk(85, "너는 서호에 놀러 가려고만 하는데， 너에게 그곳에 대해 얼마나 알고 있느냐고 묻겠다。너는 거기에 유명한 무림인사가 있는지 아나？", "talkname85", 0);
Talk(85, "견식이 없으니 사형이 말해주세요。", "talkname85", 4);
Talk(85, "잘 들어라。 고소 모용가가 가장 유명하지。 \"남모용， 북교봉\"이라 말하듯이， 북교봉은 개방 방주요， 남모용은 고소 모용가의 모용복이다。 모용 가문의 규칙을 들어봤겠지？", "talkname85", 0);
Talk(85, "\"똑같은 수법으로 갚는다！\"", "talkname85", 4);
Talk(85, "맞다。 모용 가문은 천하의 무공에 통달하여 상대방의 무공으로 적을 죽인다。 적은 죽는 순간까지 믿지 않는다지…", "talkname85", 0);
Talk(85, "그럼 우리 함부로 놀지 말죠。 만약 그가 와서 태산십필반 검법을 쓰면 큰일이잖아요。", "talkname85", 4);
do return end;
