SetRoleFace(1);
jyx2_SetTimelineSpeed(3); --播放速度X3
jyx2_PlayTimeline("[Timeline]ka691_小虾米居_醒来", 0, false);
jyx2_Wait(1);
Talk(0, "아！ 머리가 아파！ 어젯밤에 컴퓨터게임을 많이 해서 그런가？ 맞아… 난 \"의천도룡기 외전\"을 하고 있었지。 그러다 잠이 들었어。 상관없지 뭐。 이 게임을 반년이나 넘게 기다렸는데。 어서 정신 차리자！ 반드시 내가 1등으로 엔딩 봐야 한다고！", "talkname0", 1);
PlayAnimation(-1, 6890, 6932);
jyx2_PlayTimeline("[Timeline]ka691_小虾米居_站起", 0, false);
jyx2_Wait(10);
Talk(0, "어！ 내 컴퓨터는？", "talkname0", 1);
PlayAnimation(-1, 6934, 6986);
jyx2_PlayTimeline("[Timeline]ka691_小虾米居_迷惑", 0, false);
jyx2_Wait(10);
Talk(0, "이상해， 내가 언제 옷을 갈아입었지？ 그것도 옛날 옷이잖아！", "talkname0", 1);
PlayAnimation(-1, 6988, 7000);
PlayAnimation(-1, 6988, 7000);
jyx2_PlayTimeline("[Timeline]ka691_小虾米居_四处观察", 0, false);
jyx2_Wait(5);
Talk(0, "이상하다， 여긴 우리 집이 아니잖아！ 납치 된 건 아니겠지？ 설마 꿈을 꾸고 있나？ 게임을 많이 해서 드디어 머리가 이상해진 건가？", "talkname0", 1);
Talk(114, "축하합니다！", "talkname114", 0);
-- SetRoleFace(0); --改为用timeline转身
PlayWave(0);
PlayAnimation(1, 6820, 6860);
jyx2_PlayTimeline("[Timeline]ka691_小虾米居_转身", 0, false);
jyx2_PlayTimeline("[Timeline]ka691_小虾米居_软体娃娃跳起", 0, false, "Bake/Static/Others/Doll_1");
jyx2_Wait(4);
Talk(0, "알파고！", "talkname0", 1);
PlayAnimation(1, 6862, 6888);
jyx2_PlayTimeline("[Timeline]ka691_小虾米居_软体娃娃打招呼", 0, false, "Bake/Static/Others/Doll_1");
Talk(114, "정말 축하합니다！ 당신은 본 게임의 유저 중 가장 운이 좋은 사람입니다。 지관에서는 오랜 시간의 연구 끝에 완벽한 메타버스 게임을 만들어냈죠。 당신은 처음으로 우리가 직접 개발한 가상현실 세계에서 주인공이 되어 무협 세계를 모험을 할 수 있어요。", "talkname114", 0);
Talk(0, "뭐라고？ 꿈은 아니겠지？ 진짜 메타버스 세계？ 상상이겠지… 당신들이 영화처럼 이렇게도 리얼한 가상 세계를 만들어 냈다고？ 키보드나 마우스로 노는 게 아니라 직접 무협 세계에서 오감으로 느끼며 플레이할 수 있다고？", "talkname0", 1);
Talk(114, "맞아요！ '가장 리얼하게' 현실적인 체험을 할 수 있죠。 그리고 모든 유저들 중에 가장 운이 좋은 사람입니다。 원가 때문에 단 하나， 오직 당신이 구매했던 이 시리얼 넘버만이 여기 가상 세계로 \"SYNK DIVE\" 될 수 있죠。", "talkname114", 0);
Talk(0, "와！ 크랙 버전을 안 받은 게 천만다행이군。", "talkname0", 1);
Talk(114, "그래요。 우리는 저작권을 존중하는 지혜로운 고객님만을 사랑한답니다。 이제부터는 당신 힘으로 해야 돼요。 행운을 빌겠어요。 게임을 끝까지 마쳐야만 이 가상 세계를 벗어나 당신이 사는 원래 세계로 돌아갈 수 있어요。", "talkname114", 0);
Talk(0, "잠깐만， 잠깐만… 힌트 좀 안 줘？", "talkname0", 1);
Talk(114, "혹시 설명서를 먼저 안 읽었나요？", "talkname114", 0);
Talk(0, "미안， 난 설명서를 읽는 습관이 없어서。", "talkname0", 1);
Talk(114, "모두가 똑같다니까！ 하나같이 설명서를 안 보니， 원。 스스로들 대단한 줄 안다니까？", "talkname114", 0);
Talk(0, "됐어。 다음에 꼭 먼저 볼게。 이 게임의 목적 정도는 말해 줄 수 있지？", "talkname0", 1);
Talk(114, "그건 스스로 게임 속에서 찾아내야만 해요。 하지만…", "talkname114", 0);
Talk(0, "하지만 뭐？", "talkname0", 1);
Talk(114, "그래도 힌트는 좀 드릴게요。 게임 속에는 매우 중요한 사람이 있어요， 당신은 먼저 그를 찾아야만 해요。 그 사람은 아는 것이 매우 많아서 당신이 그를 찾으면 게임의 대략적인 목적을 알 수 있을 거예요。 그리고 그를 먼저 찾아야만 게임 속의 많은 장소가 열리고 들어갈 수 있어요。 그전에 당신이 갈 수 있는 곳은 여인숙과 그 사람의 집 두 곳뿐이랍니다。 그러니까 얼른 그 사람 먼저 찾아야 돼요！", "talkname114", 0);
Talk(0, "넌 뭐냐？", "talkname0", 1);
Talk(114, "모든 걸 알아버리면 게임의 묘미가 없죠。", "talkname114", 0);
Talk(0, "음…", "talkname0", 1);
Talk(114, "걱정하지 마세요。 게임은 이제 시작됐으니， 초반엔 그리 어렵지 않을 거예요。 이곳을 나간 뒤 맞은편 객잔에 가서 다양한 정보를 얻어보세요。 그리고 이 게임의 배경이 고전이라는 것을 잊지 말고 말과 행동에 주의하세요。 참， 이 게임 모드에서 \"캐릭터 사망 시， 실제 죽음 적용'\" 모드를 골랐다는 것을 깜빡했어요。 그래서… 하느님께서 보우해 주시기를 바랍니다！", "talkname114", 0);
Talk(0, "내가 제일 무서운 건 이거야。 몇 년 동안이나 공을 들여 사람 죽이는 게임을 만들었다고？ 너희 미친 거 아니냐？", "talkname0", 1);
Talk(114, "겁내지 마세요。 이 방 안에 당신을 위해 몇 가지 물품을 준비했는데， 모두 각종 상자 안에 들어 있습니다。 이 중 몇몇 단약은 당신의 생명이 위태로울 때 사용하세요。 또 몇 가지 당신이 갖고 있는 현대의 물건들을 사용해도 좋아요 그리고 당신의 정보를 보니 권법도 조금 할 줄 아는것 같으니 문제없을 겁니다。", "talkname114", 0);
Talk(0, "권법은 무슨， 야구가 언제부터 권법에 속했냐？", "talkname0", 1);
Talk(114, "됐어요！ 더 이상 말하면 안 돼요。 게임 개발자가 저에게 말을 너무 많이 하면 안 된다고 했단 말이에요。 그렇지 않으면 제 코드를 게임에서 아예 지워버린다고… 이런 말이 있죠… '좋은 게임은 불친절하다'。 그럼 이제 정말 ＢＹＥ！ＢＹＥ！", "talkname114", 0);
DarkScence(); --增加过场
jyx2_StopTimeline("[Timeline]ka691_小虾米居_醒来");
jyx2_StopTimeline("[Timeline]ka691_小虾米居_站起");
jyx2_StopTimeline("[Timeline]ka691_小虾米居_迷惑");
jyx2_StopTimeline("[Timeline]ka691_小虾米居_四处观察");
jyx2_StopTimeline("[Timeline]ka691_小虾米居_转身");
jyx2_StopTimeline("[Timeline]ka691_小虾米居_软体娃娃跳起");
jyx2_StopTimeline("[Timeline]ka691_小虾米居_软体娃娃打招呼");
jyx2_SetTimelineSpeed(1); --播放速度还原
SetRoleFace(0); --修正朝向角度
LightScence(); --增加过场
ModifyEvent(-2, 0, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
ModifyEvent(-2, 1, -2, -2, 692, -1, -1, -2, -2, -2, -2, -2, -2);
do return end;
