Talk(11, "소형제는 어느 문파의 사람이지？ 나머지 다섯 문파 사람은？", "talkname11", 0);
Talk(0, "전 육대파가 아닙니다。 명교에게서 책의 행방을 물으려고 왔어요。", "talkname0", 1);
Talk(11, "\"의천도룡기\"겠지？", "talkname11", 0);
Talk(0, "강호의 소문대로 \"의천도룡기\" 가 명교에게 있군。 선배님， 저에게 빌려줄 수 있겠소？", "talkname0", 1);
Talk(11, "빌려달라고？ 네가 감히 이 광명좌사 양소는 무시하고 명교가 혼란한 틈을 타서 손쉽게 \"의천도룡기\"를 얻으려는 수작이냐！", "talkname11", 0);
Talk(0, "사실， 그 책이 내게 아주 중요합니다요。 없으면 큰일난다구！", "talkname0", 1);
Talk(11, "네놈을 먼저 손봐줘야겠다。 육대파가 들이닥쳐 네 수작에 놀아나기 전에！", "talkname11", 0);
Talk(0, "난 명교를 방해하는 게 아니오。 지금 힘이 있을 때， 내가 아니라 육대파를 물리치면 되잖소？", "talkname0", 1);
Talk(11, "널 상대 하는 건 힘이 안 든다！ 덤벼라！", "talkname11", 0);
if TryBattle(9) == true then goto label0 end;
    Dead();
    do return end;
::label0::
    DarkScence();
    ModifyEvent(-2, 4, -2, -2, -1, -1, -1, 5308, 5308, 5308, -2, -2, -2);--by fanyu|战斗后人物贴图替换。场景12-编号4
    ModifyEvent(-2, 5, -2, -2, -1, -1, -1, 5310, 5310, 5310, -2, -2, -2);--by fanyu|战斗后人物贴图替换。场景12-编号5
    ModifyEvent(-2, 6, -2, -2, -1, -1, -1, 5312, 5312, 5312, -2, -2, -2);--by fanyu|战斗后人物贴图替换。场景12-编号6
    ModifyEvent(-2, 7, -2, -2, -1, -1, -1, 5314, 5314, 5314, -2, -2, -2);--by fanyu|战斗后人物贴图替换。场景12-编号7
    ModifyEvent(-2, 8, -2, -2, -1, -1, -1, 5312, 5308, 5312, -2, -2, -2);--by fanyu|战斗后人物贴图替换。场景12-编号8
    ModifyEvent(-2, 9, -2, -2, -1, -1, -1, 5310, 5310, 5310, -2, -2, -2);--by fanyu|战斗后人物贴图替换。场景12-编号9
    ModifyEvent(-2, 10, 1, 1, -1, -1, -1, 5298, 5298, 5298, -2, -2, -2);--by fanyu|战斗后成昆出现。场景12-编号10
    jyx2_ReplaceSceneObject("", "NPC/chengkun", "1");--成昆出现
    LightScence();
    Talk(0, "양 좌사， 내가 말했지 않소， 나랑 싸우는 데 힘이 많이 든다고요。", "talkname0", 1);
    Talk(11, "너……", "talkname11", 0);
    Talk(18, "하！ 하！ 하！ 잘한다！ 다들 잘해！", "talkname18", 0);
    Talk(0, "어디 대머리 주제에 껄렁대고 있느냐？", "talkname0", 1);
    Talk(11, "누구냐！ 어떻게 명교에 들어왔지？", "talkname11", 0);
    Talk(18, "나 성곤 말이냐？ 당연히 소란을 피우려고 들어왔지！ 애송이 덕분에 힘 안 들이고 쉽게 올 수 있었다。", "talkname18", 0);
    Talk(11, "당신은 혼원벽력수 성곤？ 사 법왕의 사부？", "talkname11", 0);
    Talk(18, "맞다。 그 멍청이의 사부다。 그의 경솔함 때문에 명교는 육대문파와 원한이 생긴 거지！ 이제 명교는 잿더미가 되어 나의 오랜 염원도 이루리다！ 하하하！", "talkname18", 0);
    Talk(0, "내 생각이 맞는다면， 이 모든 게 너의 수작이군！", "talkname0", 1);
    Talk(18, "아주 영리한 꼬마구나。 사손을 분노케 해 살인을 저지르게 했다。 난 일부러 강호 사람들이 명교의 사손에게 원한을 사게 하고， 각 문파가 명교와 원수가 되도록 정성껏 치밀한 계획을 세웠지。", "talkname18", 0);
    Talk(11, "아니， 왜 그런 짓을 했나！", "talkname11", 0);
    Talk(18, "네 교주 양정천에게 물어봐라。 분명히 나의 사랑스런 아내였는데。 그 마두가 마교의 교두가 되어 내 아내를 강탈했다！ 난 맹세했다。 마교의 영생을 가로막겠다고。 20년 이상 품어 온 다짐이 드디어 오늘에야 이루어지는 걸 보는구나！ 하하！ 지금 즘이면 육대파가 모두 합세해 광명정을 공격하고 있을 것이다。", "talkname18", 0);
    Talk(11, "뭐라고？ 얼른 광명정으로 가야 한다！", "talkname11", 0);
    Talk(18, "멀리 갈 필요 없이 여기서 죽음을 맞이해라。", "talkname18", 0);
    Talk(0, "여보세요！ 틀딱 대머리 당나귀야， 너희 같은 나쁜 놈들은 어째서 매번 자신의 악행을 자랑하길 좋아하지？ 우리 같은 협사들이 당연히 죽을 것처럼 네 음모를 까발리는 거냐？ 양좌사， 이 대머리 당나귀는 내가 맡을 테니， 먼저 광명정으로 돌아가시오。 이 자에게 배드 엔딩을 선사해 줘야겠어。", "talkname0", 1);
    Talk(18, "흥！ 애송이 주제에 감히！", "talkname18", 0);
    Talk(11, "소협， 정말… 괜찮겠나？", "talkname11", 0);
    Talk(0, "물론， 괜찮지 않을 수 없죠。 내가 안 된다면 당신한테도 무리일 테니 얼른 가쇼。 나도 곧 뒤따를 테니。", "talkname0", 1);
    AddRepute(4);
    if TryBattle(10) == true then goto label1 end;
        Dead();
        do return end;
::label1::
        DarkScence();
        jyx2_ReplaceSceneObject("", "NPC/yangxiao", "");--杨逍离开去光明
        ModifyEvent(-2, 4, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);--by fanyu|人物消失。场景12-编号4
        ModifyEvent(-2, 5, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);--by fanyu|人物消失。场景12-编号5
        ModifyEvent(-2, 6, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);--by fanyu|人物消失。场景12-编号6
        ModifyEvent(-2, 7, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);--by fanyu|人物消失。场景12-编号7
        ModifyEvent(-2, 8, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);--by fanyu|人物消失。场景12-编号8
        ModifyEvent(-2, 9, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);--by fanyu|人物消失。场景12-编号9
        ModifyEvent(-2, 0, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);--by fanyu|人物消失。场景12-编号0
        ModifyEvent(-2, 10, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);--by fanyu|人物消失。场景12-编号10
         jyx2_ReplaceSceneObject("", "NPC/NPC1", "");--明教教徒离开去光明顶
         jyx2_ReplaceSceneObject("", "NPC/NPC5", "");--明教教徒离开去光明顶
         jyx2_ReplaceSceneObject("", "NPC/NPC6", "");--明教教徒离开去光明顶
         jyx2_ReplaceSceneObject("", "NPC/NPC7", "");--明教教徒离开去光明顶
         jyx2_ReplaceSceneObject("", "NPC/NPC8", "");--明教教徒离开去光明顶
         jyx2_ReplaceSceneObject("", "NPC/NPC9", "");--明教教徒离开去光明顶
        jyx2_ReplaceSceneObject("", "NPC/chengkun", "");--成昆从地道逃跑    성곤은 지하도에서 도망쳤다
        ModifyEvent(-2, 11, 1, 1, 80, -1, -1, 5310, 5310, 5310, -2, -2, -2);--by fanyu|生成人物，启动80号脚本。场景12-编号11    인물 생성, 80번 스크립트 시작.장면 12 - 번호 11
        jyx2_ReplaceSceneObject("", "NPC/chuzi_new", "1");--厨子出来    요리사 나와!??
        SetScenceMap(-2, 1, 28, 24, 0);--by fanyu|明教地道的门打开。场景12-坐标28,24    명교 땅굴의 문이 열리다.장면 12 - 좌표 28, 24
		jyx2_FixMapObject("明教分舵开门",1);    
        LightScence();
        
        Talk(0, "쥐새끼처럼 빠져나갔군。 이 도둑놈은 너무 빨라서 쫓을 게 아니라 서둘러 광명정으로 가봐야겠다！", "talkname0", 1);
        
        AddRepute(3);
        ChangeMMapMusic(3);
       
do return end;
