Talk(74, "신야의 유황숙이 이 엄동설한에 진리를 찾고자 나 수경선생 이추를 찾아왔는가？", "talkname74", 0);
Talk(0, "이추？ 이 자가 남현북추 중 북추라 불리는 자인가？' 미친 사람처럼 보이는데 믿어도 될까？'", "talkname0", 1);
Talk(74, "날 의심하는가？", "talkname74", 0);
Talk(0, "내가 무슨 생각을 하는지 알다니 무서운 자야！' 당신은 남현보다 더 많은 사실을 알고 있나요？", "talkname0", 1);
Talk(74, "남현은 아무것도 몰라！ 세 살 동자도 아는 기초적인 지식만 알뿐이야！ 나 이추는 무림에서 아무도 모르는 큰 비밀을 알고 있다。 지혜과를 낭비하지 말고 날 주는 게 유익할 거야。 내 능력이 의심스럽다면 강호에서 유일한 신비로운 물건을 보여주마。 책상 위의 수정구가 보이나？ 그 걸 만지면 놀라운 일이 벌어질 거야。", "talkname74", 0);
ModifyEvent(-2, -2, -2, -2, 827, 751, -1, -2, -2, -2, -2, -2, -2);
ModifyEvent(-2, 2, -2, -2, 828, -1, -1, -2, -2, -2, -2, -2, -2);
do return end;
