Talk(0, "형씨들， 요즘 강호에 새로운 소식이 있소？", "talkname0", 1);
Talk(79, "웃긴 일이 있었죠…현철령을 얻기 위해 금도채와 설산파가 대거 싸움을 벌였는데， 우여곡절 끝에 한 꼬마 거지의 손에 현철령이 떨어지게 됐죠。", "talkname79", 0);
Talk(79, "현철령의 주인은 그 해， 세 명의 은인에게 각각 현철령을 주며 한 가지 일을 해주겠다고 약속했는데。 마지막 현철령을 가진 자가 하필 꼬마 거지라， 사연객은 의외로 부탁이 쉽겠다며 좋아했죠。 한데 부탁을 안 하지 뭐예요？ 사연객은 어쩔 줄을 몰라 하더군요。", "talkname79", 4);
Talk(0, "사연객의 거처가 어디죠？ 내가 가서 문제를 해결하리다。", "talkname0", 1);
Talk(79, "너는 네가 뭐라도 된다고 생각하니， 무림의 맹주？ 내가 보기에 너는 마천애에 올라갈 수조차 없을 것 같다。", "talkname79", 0);
Talk(79, "맞아！ 마천애에 오르려면 경공이 매우 뛰어나야 해。", "talkname79", 4);
Talk(0, "시간만 뺏겼군。", "talkname0", 1);
do return end;
