Talk(111, "자자 자！ 여긴 없는 물건이 없습니다！ 손님， 물건을 보세요。 나 소보는 정직하게 장사하는 사람이오。", "talkname111", 0);
Talk(0, "와！ 정말 물건이 많아。 소 형은 재주가 좋군！", "talkname0", 1);
Talk(111, "과찬의 말씀이지。 난 무공이 약해서 강호에서 살아남으려면 장사를 할 수밖에！ 난 여러 객잔을 돌아다니면서 좋은 물건을 구하고 또 그걸 팔아서 생계를 유지해야 해。", "talkname111", 0);
Talk(0, "형님， 이름이 뭐죠？", "talkname0", 1);
Talk(111, "내 이름은 위…… 그냥 서로 편하게 소보라고 불러라。 내 도움이 필요하면 각지의 객잔에서 날 찾으면 돼。 단 난 방랑객이라 어느 객잔에 있을지는 모르니， 운이 좋아야 만날 수 있네。", "talkname111", 0);
ModifyEvent(-2, -2, -2, -2, 938, -1, -1, -2, -2, -2, -2, -2, -2);
ModifyEvent(-2, 17, 0, 0, -1, -1, 939, -1, -1, -1, -2, -2, -2);
ModifyEvent(-2, 18, 0, 0, -1, -1, 939, -1, -1, -1, -2, -2, -2);
--参考原作, 对话后应该直接打开商店页面。但由于目前逻辑问题，需要另外触发trigger才能打开商店页面。
--add by eaphone at 2021/6/8
WeiShop()
do return end;
