Talk(16, "소협이 부인을 구해준 은혜， 뭘로 갚아야 할지…", "talkname16", 0);
Talk(0, "남을 돕는 건 기쁨이라 했습니다。 천만의 말씀입니다。 한데 금화파파는… 왠지 악인 같지가 않더군요…", "talkname0", 1);
Talk(16, "사실… 우리 부부의 내기 때문에 많은 환자를 해쳤지。", "talkname16", 0);
Talk(0, "내기라뇨？", "talkname0", 1);
Talk(16, "우리 부부는 동문이지만， 배운 학문이 틀리다네。 난 의술을 공부했고， 아내는 독술을 공부했지。 강호인들은 아내를 \"독선\"이라고 불렀네。 그때 난 젊은 객기로 아내가 해친 자들을 구했기에， 화가 난 아내는 날 이기기 위해 많은 사람들을 중독시키게 되었지。 이런 일이 반복되자， 불상사를 막기 위해 \"명교사람만 구한다！\"라고 맹세했네。 우린 명교 출신이라 아내가 동문을 해치진 않으리란 나의 안일한 생각이었지。", "talkname16", 0);
Talk(0, "그럼 은엽 선생은 명교사람이 아니라서 구하지 않은 거군요。", "talkname0", 1);
Talk(16, "맞네。", "talkname16", 0);
Talk(17, "사형， 우리의 실수예요。 영사도에 갇혀있는 동안 금화파파의 진짜 정체가 명교의 사대호법 중 우두머리인 것 같았어요。", "talkname17", 0);
Talk(16, "그렇다면 그녀가 바로 자삼용왕？ 불가능해！ 자삼용왕은 명교 최고의 미인이거늘！ 어찌 그런 모습을…", "talkname16", 0);
Talk(17, "무슨 사연 때문에 변장했을 지도 몰라요。", "talkname17", 0);
Talk(16, "그렇다면 형제를 해친 셈이 되는군… 아！ 지금부터 내가 했던 맹세를 철회하겠다。 의술은 사람을 구하기 위해 있는 것！ 나 자신이 부끄럽다…… 소협은 강호를 떠돌며 물건을 찾는다고 들었네。 강호는 위험한 곳이라， 우리 부부의 의술， 독술이 도움이 될지도 모르네。", "talkname16", 0);
Talk(17, "도움이 필요하면 말해！ 우리 부부는 기꺼이 도와주겠네！ 호접곡에 필요한 물건이 있으면 얼마든지 가져가도 돼。", "talkname17", 0);
ModifyEvent(-2, 0, -2, -2, 96, -1, -1, -2, -2, -2, -2, -2, -2);
ModifyEvent(-2, 1, -2, -2, 97, -1, -1, -2, -2, -2, -2, -2, -2);
Add3EventNum(73, 2, 0, 0, 1);
if JudgeEventNum(3, -1) == true then goto label0 end;
    ModifyEvent(-2, 3, -2, -2, 903, -1, -1, -2, -2, -2, -2, -2, -2);
::label0::
    if JudgeEventNum(4, -1) == true then goto label1 end;
        ModifyEvent(-2, 4, -2, -2, 904, -1, -1, -2, -2, -2, -2, -2, -2);
::label1::
        if JudgeEventNum(5, -1) == true then goto label2 end;
            ModifyEvent(-2, 5, -2, -2, 905, -1, -1, -2, -2, -2, -2, -2, -2);
::label2::
do return end;
